{
    "source": "https://devpost.com/software/cadence-gs2bcw",
    "title": "Cadence",
    "blurb": "We create volumetric avatars in AR that improve second language learning and onboarding for international travelers.",
    "awards": [],
    "videos": [
        "https://www.youtube.com/embed/C19B-jHC3PU?enablejsapi=1&hl=en_US&rel=0&start=&version=3&wmode=transparent"
    ],
    "images": [],
    "team": [
        {
            "name": "Mike H",
            "about": "I pitched the idea, built the team according to the product needs, wrote the copy, and managed the product from idea to MVP.",
            "photo": "https://media.licdn.com/dms/image/C5603AQHifx7-vsnaNw/profile-displayphoto-shrink_100_100/0?e=1553126400&height=180&t=_-6DKeEkR2RjL4czmRhoR4iIRchImpdpIggOBi7dseE&v=beta&width=180"
        },
        {
            "name": "Becky Lane",
            "about": "I created volumetric video using DepthKit and the Microsoft Xbox Kinnect. ",
            "photo": "https://graph.facebook.com/10154715855227471/picture?height=180&width=180"
        },
        {
            "name": "ShuningWang0411",
            "about": "",
            "photo": "https://graph.facebook.com/1111878235640682/picture?height=180&width=180"
        }
    ],
    "built_with": [
        "android",
        "c#",
        "depthkit",
        "ios",
        "unity",
        "vuforia"
    ],
    "content_html": "<div>\n<h2>Inspiration</h2>\n<p>We are inspired by the history of narrative based language immersion education and pioneering enhanced reality ESL programs like MondlyVR and immerse.me.</p>\n<h2>What it does</h2>\n<p>We create AR experiences that use empirical principles of learning design to enhance learning outcomes for second language acquisition. Our technology has many potential use cases, but for this project we have chosen the familiar situation of participants traveling to an international hackathon.</p>\n<p>Before arriving to the Hackathon, our user can utilize our technology to practice asking for directions in their native language. Upon arriving, our user can scan the MIT Reality Virtually logo using Vuforia to see a volumetric avatar which will tell them where the Hackathon is located, and how to find it. </p>\n<p>Our AR solution can be layered over any conference logo. Entire FAQs could be integrated into our structure to streamline the on-boarding experience for international attendees, as well as help users practice foreign language skills in preparation for international events.</p>\n<h2>How we built it</h2>\n<p>We built the AR component using the Vuforia augmented reality SDK and Unity. We recorded the volumetric video using Depthkit and a Kinect. Special thanks to the Bok Center at Harvard for giving us professional studio access, and to the small nook on the 5th floor of the Media Lab for giving us impromptu studio access. </p>\n<h2>Challenges we ran into</h2>\n<p>Originally we envisioned an entire mixed reality curriculum targeting immersive language learning with use cases taken from everyday life. Based on the Gradual Release of Responsibility model (GRR) fr 2nd language learning, our would have three phases. First, a period of modeled instruction, in which users would watch first person 360 videos in VR of common travel situations, such as asking for directions. Next would be a section of guided instruction, where they would be put in the scene again, and it would only progress after they accurately accomplished the learning objective with a prompt. Lessons would then be reinforced through an independent learning model, where users could project avatars from the situations they watched into AR using Vuforia. Even without a headset, users could practice the situations with realistic avatars on any flat plane.  Stretch goals included a peer learning aspect with VR video-conferencing, where multiple non-native speakers could replay each situation with a partner, as well as a full immersion based chat room. </p>\n<p>Unfortunately, we ran into technical challenges from the beginning. No one on our team is a professional coder. Our only trained engineer left the team originally, came back, and then was sick again on the final day. Because of this we were not able to integrate 360 video into Unity or incorporate any of the voice recognition or branching conversational paths as we had planned.</p>\n<p>We pivoted to focus on the AR component using Vuforia, and were unable to get it to work on Android phones. All hope seemed lost as nothing was working the night before submission. </p>\n<h2>What we learned</h2>\n<p>Without any prior experience with volumetric video or AR, we recorded over fifty interactions with six different avatars in six out of the 35 languages represented here today. We learned about volumetric capture, AR development, and deployment on mobile phones.</p>\n<h2>What's next for Cadence</h2>\n<p>We're going to build our original vision!</p>\n</div>",
    "content_md": "\n## Inspiration\n\n\nWe are inspired by the history of narrative based language immersion education and pioneering enhanced reality ESL programs like MondlyVR and immerse.me.\n\n\n## What it does\n\n\nWe create AR experiences that use empirical principles of learning design to enhance learning outcomes for second language acquisition. Our technology has many potential use cases, but for this project we have chosen the familiar situation of participants traveling to an international hackathon.\n\n\nBefore arriving to the Hackathon, our user can utilize our technology to practice asking for directions in their native language. Upon arriving, our user can scan the MIT Reality Virtually logo using Vuforia to see a volumetric avatar which will tell them where the Hackathon is located, and how to find it. \n\n\nOur AR solution can be layered over any conference logo. Entire FAQs could be integrated into our structure to streamline the on-boarding experience for international attendees, as well as help users practice foreign language skills in preparation for international events.\n\n\n## How we built it\n\n\nWe built the AR component using the Vuforia augmented reality SDK and Unity. We recorded the volumetric video using Depthkit and a Kinect. Special thanks to the Bok Center at Harvard for giving us professional studio access, and to the small nook on the 5th floor of the Media Lab for giving us impromptu studio access. \n\n\n## Challenges we ran into\n\n\nOriginally we envisioned an entire mixed reality curriculum targeting immersive language learning with use cases taken from everyday life. Based on the Gradual Release of Responsibility model (GRR) fr 2nd language learning, our would have three phases. First, a period of modeled instruction, in which users would watch first person 360 videos in VR of common travel situations, such as asking for directions. Next would be a section of guided instruction, where they would be put in the scene again, and it would only progress after they accurately accomplished the learning objective with a prompt. Lessons would then be reinforced through an independent learning model, where users could project avatars from the situations they watched into AR using Vuforia. Even without a headset, users could practice the situations with realistic avatars on any flat plane. Stretch goals included a peer learning aspect with VR video-conferencing, where multiple non-native speakers could replay each situation with a partner, as well as a full immersion based chat room. \n\n\nUnfortunately, we ran into technical challenges from the beginning. No one on our team is a professional coder. Our only trained engineer left the team originally, came back, and then was sick again on the final day. Because of this we were not able to integrate 360 video into Unity or incorporate any of the voice recognition or branching conversational paths as we had planned.\n\n\nWe pivoted to focus on the AR component using Vuforia, and were unable to get it to work on Android phones. All hope seemed lost as nothing was working the night before submission. \n\n\n## What we learned\n\n\nWithout any prior experience with volumetric video or AR, we recorded over fifty interactions with six different avatars in six out of the 35 languages represented here today. We learned about volumetric capture, AR development, and deployment on mobile phones.\n\n\n## What's next for Cadence\n\n\nWe're going to build our original vision!\n\n\n"
}