{
    "source": "https://devpost.com/software/cosmovr",
    "title": "CosmosVR",
    "blurb": "Explore our cosmos in VR exploiting movement and scale to develop an intuitive understanding of vast structures",
    "awards": [
        "Data Visualization Challenge (Fidelity)"
    ],
    "videos": [
        "https://www.youtube.com/embed/bbMWvdTdhs4?enablejsapi=1&hl=en_US&rel=0&start=&version=3&wmode=transparent"
    ],
    "images": [
        {
            "title": "introduction slide",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/742/570/datas/original.png"
        }
    ],
    "team": [
        {
            "name": "Beste Aydin",
            "about": "I am an undergraduate student at the University of Michigan who is studying Computer Engineering. I worked on the Unity development and the overall design. While working on the project, I learned a lot more about Unity and developing for VR. ",
            "photo": "https://www.gravatar.com/avatar/90786c1d3b7fe339a9714bd96e9689e5?d=https%3A%2F%2Fdevpost-challengepost.netdna-ssl.com%2Fassets%2Fdefaults%2Fno-avatar-180.png&s=180"
        },
        {
            "name": "dborgesr",
            "about": "I'm a computational biologist with deep experience processing and visualizing large biologically related datasets. I was able to aid in identifying the best way to process and flip the data into the right format in order to load into Unity and begin manipulating it. I definitely intend to extend and leverage what we have created to understand the data that I manipulate daily.",
            "photo": "https://www.gravatar.com/avatar/0ba5664082199d26f8be4e1b2cc000a5?d=https%3A%2F%2Fdevpost-challengepost.netdna-ssl.com%2Fassets%2Fdefaults%2Fno-avatar-180.png&s=180"
        },
        {
            "name": "milchada",
            "about": "I'm a graduate student in computational cosmology, so I run and analyse simulations like this one for a living. I love communicating science to a general audience, and write for Yale Scientific, Science in the News and AstroBites. ",
            "photo": "https://avatars3.githubusercontent.com/u/8669608?height=180&v=4&width=180"
        },
        {
            "name": "paulrus",
            "about": "I'm a software developer in the self-driving automotive space, I was really happy to work on a completely different type of project than my day to day work! In this project I wrote most of the C# scripting for Unity. I also led the User Story development to drive product definition. I learned a ton about rendering in Unity and hope to take some of that knowledge back to my work to render point-cloud data for Radar and Lidar sensors!",
            "photo": "https://graph.facebook.com/10157029303841263/picture?height=180&width=180"
        }
    ],
    "built_with": [
        "hdf5",
        "python",
        "steamvr",
        "unity"
    ],
    "content_html": "<div>\n<p><img alt=\"Introduction slide\" data-canonical-url=\"https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/cosmos_intro.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--Na6qHAjN--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/cosmos_intro.png\"/></p>\n<h2>Inspiration</h2>\n<p>When you think big, you might think of our Solar System, or maybe even our galaxy - but our cosmos is far, far more vast than that. Our home galaxy, the Milky Way, hosts hundreds of billions of stars, enough gas to make billions more,   and five times more mass in something mysterious, called Dark Matter. At least trillions - that is millions of millions - of galaxies fill up the visible Universe. Together, they form the structure you see now, called the Cosmic Web.</p>\n<p>Some galaxies, like our Milky Way, live in groups with a few dozen partners. The Milky Way is on a collision course with our nearest neighbour, Andromeda. Don't worry, the collision isn't due for another 4 billion years! But when it happens, it will be spectacular. Groups live in long chains called cosmic filaments, which eventually feed the largest groups, called galaxy clusters. </p>\n<h2>What it does</h2>\n<p>Look around you. Navigate your way through filaments, groups, and individual galaxies. When you find an interesting object, give it a little attention. If you look long enough, you'll get to zoom in and see it in much more detail, and learn more about that type of object. What do you see? How do the stars, gas and dark matter live in relation to each other?</p>\n<h2>The Data</h2>\n<p>Every point you see in this experience is a real data point from the Illustris cosmological simulation. This simulation started with a Universe merely 51 million years old and runs it all the way to the present day, at age 13.7 <em>billion</em> years. Astronomers know that in the early days, the Universe was largely very smooth, just one big hot soup of protons, electrons, light particles, and dark matter. If one part of this soup is a little denser, it attracts other parts to it by gravity and grows even denser over time; regions that were less dense in the beginning grow emptier and emptier. As gas gets denser, some of it forms clumps that eventually form stars, and the Universe starts to light up. Finally, by the present day - which we show - the large scale structure looks like a giant web, called the Cosmic Web. The zoom-in at the end takes you to high-resolution data on a single galaxy.</p>\n<p>This simulation thus shows our best understanding to date of how the Universe evolves on the largest scales. Urmila published her first academic paper on measuring dark matter distribution in large groups of galaxies (galaxy clusters) by looking at the light from the stars in the cluster galaxies, using this very simulation! Dozens of papers have used this simulation to understand what exactly are the predictions of our current model of dark matter and dark energy, and how these predictions compare to observations. Now, anyone can experience this.</p>\n<h2>User Experience</h2>\n<p>We tried to design our experience around the user. We created personas that we wanted to target the experience towards.</p>\n<p><img alt=\"Users\" data-canonical-url=\"https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.003.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--N_cCW0bi--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.003.png\"/></p>\n<p>Then for each user, we mapped out there \"User Journey\" through our application. We tried to imagine what would be important at each stage for each user. </p>\n<p><img alt=\"BobUserStory\" data-canonical-url=\"https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.004.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--aTcicRrk--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.004.png\"/>\n<img alt=\"JessicaUserStory\" data-canonical-url=\"https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.005.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--WOoWCq4A--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.005.png\"/></p>\n<p><img alt=\"AlexUserStory\" data-canonical-url=\"https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.006.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--o3fDxG7b--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.006.png\"/></p>\n<p>Our conclusion from this study is that we wanted to primarily target an audience like \"Bob\" - someone who doesn't have a lot of technical knowledge already but is interested and wants to have an exciting experience! We also considered expanding this in the future to target researchers like Alex as a secondary audience who might use this for further data analysis that isn't possible in traditional mediums.</p>\n<h1>Design</h1>\n<p>Based on our user story conclusion we tried to design an experience that would fit our primary audience. Part of this was designing a fun and \"cool\" heads-up-display that would make the user feel like they're in an astronaut's helmet. Part of this design choice was also to counteract the possibility of a nauseating experience caused by flying in space. We also wanted to implement a system on changing helmets to see different types of information such as gas and stars. These designs were first sketched on paper, which is shown below.</p>\n<p><img alt=\"Mockup\" data-canonical-url=\"https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/Mockups/Mockups.jpg\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--EN-_tQlf--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/Mockups/Mockups.jpg\"/></p>\n<p>Next, the heads-up-display design was implemented using Inkscape and imported to Unity.</p>\n<p><img alt=\"hudImage\" data-canonical-url=\"https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/Mockups/hudImage.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--GjBmm2-p--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/Mockups/hudImage.png\"/></p>\n<h2>Implementation</h2>\n<p>We downloaded snapshots from the openly accessible Illustris simulation (<a href=\"http://www.illustris-project.org/data\" rel=\"nofollow\">www.illustris-project.org/data</a>). Like most astrophysical simulations, this was in HDF5 format. We used Python to select the information we wanted to visualize - density of dark matter and gas, the colors of star particles, and positions for everything - and convert it into .xyz files for Meshlab (<a href=\"http://www.meshlab.net/\" rel=\"nofollow\">http://www.meshlab.net/</a>). Meshlab converted these into PLY files, and we found an open-source library to load these into Unity. This gave us our first view of the Universe in 3D!</p>\n<p>We then used the Vive SDK to allow users to fly through the simulation using the controllers. </p>\n<h2>Challenges we ran into</h2>\n<p>Loading the particle data into Unity was a huge challenge! We first considered reading in JSON files and making a ParticleSystem, but couldn't figure out how to do this. The Meshlab workaround really saved the day. </p>\n<p>Rendering the particles was also a challenge. The dataset was so large and we were worried about performance and frame-rate. Luckily we found and utilised a public project that had a custom mesh renderer to visualise a large point cloud (<a href=\"https://blog.sketchfab.com/tutorial-processing-point-cloud-data-unity/\" rel=\"nofollow\">https://blog.sketchfab.com/tutorial-processing-point-cloud-data-unity/</a>). </p>\n<p>We seem to be having a Unity sound driver issue, so that we can't hear any sounds playing from Unity. We have been working with a mentor to debug this, but unfortunately ran out of time. We would like to expand the interactions to support grab-and-move style locomotion, more advanced selection of objects (galaxy groups, clusters, etc.) using both hand and eye controllers, and an in-depth HUD. For this project we developed a simple \"fly-around\" movement system using the Vive hand controller triggers. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We thought a lot about the user experience and pedagogical content. We are really proud that we could show an accurate data-set without compromising performance. </p>\n<p>We are also really proud that our team (all strangers before this weekend) came together and utilised our diverse skillsets to create a unique and engaging experience! We come from a variety of backgrounds - Astronomy, Biology,  UI Research, Design, and Software. </p>\n<h2>What we learned</h2>\n<p>Beste, Diego and Paul learned about extragalactic astronomy (including the term extragalactic astronomy), the large scale structure of the Universe, and how astronomers simulate and observe the various components of the Universe. Urmila learned to work with HDF5 files instead of relying on other people's highly specialized wrappers. We all got a really deep dive into Unity and the Vive SDK, including how to load in and render large datasets, how to move around the space and various ways to trigger actions. We quickly gelled as team members and worked like a well-oiled machine! </p>\n<h2>What's next for CosmoVR</h2>\n<p>We want to add a lot more sound and information to the app to make it a powerful educational tool for consumers at various levels, ranging from curious school kids to scientific researchers. We also want to support more zoom levels and the ability to dynamically change scale without loading new scenes. Since a typical dataset in this space has different time slices we'd also like to visualise how these particles move and change over the course of billions of years. We'd also like to continue implementing our interaction points. </p>\n<p>One future work will be to try and port this experience to a standalone headset and prove out the feasibility on a reduced performance hardware platform (like the Oculus Go or GearVR). We believe even a simplified port to a standalone headset could increase adoption in museums and schools who don't want to spend excess resources to drive an HTC Vive.</p>\n<h2>Resources Used</h2>\n<p><strong>Unity Assets</strong></p>\n<p><a href=\"https://assetstore.unity.com/packages/3d/environments/sci-fi/sci-fi-platforms-3d-models-83091\" rel=\"nofollow\">https://assetstore.unity.com/packages/3d/environments/sci-fi/sci-fi-platforms-3d-models-83091</a> (not used in final project)\n<a href=\"https://assetstore.unity.com/packages/2d/textures-materials/sky/free-hdr-sky-61217\" rel=\"nofollow\">https://assetstore.unity.com/packages/2d/textures-materials/sky/free-hdr-sky-61217</a> (not used in final project)\n<a href=\"https://assetstore.unity.com/packages/2d/textures-materials/sky/urban-night-sky-134468\" rel=\"nofollow\">https://assetstore.unity.com/packages/2d/textures-materials/sky/urban-night-sky-134468</a>\n<a href=\"https://nasa3d.arc.nasa.gov/detail/helmet\" rel=\"nofollow\">https://nasa3d.arc.nasa.gov/detail/helmet</a></p>\n<p><strong>Unity Libraries and Projects</strong></p>\n<p><a href=\"https://github.com/leon196/PointCloudExporter\" rel=\"nofollow\">https://github.com/leon196/PointCloudExporter</a></p>\n<p><a href=\"http://wiki.unity3d.com/index.php/SimpleJSON\" rel=\"nofollow\">http://wiki.unity3d.com/index.php/SimpleJSON</a> (not used in final project)</p>\n<p><strong>Other Tools</strong></p>\n<p>Meshlab: <a href=\"http://www.meshlab.net/\" rel=\"nofollow\">http://www.meshlab.net/</a></p>\n<p>Illustris: <a href=\"http://www.illustris-project.org/data\" rel=\"nofollow\">www.illustris-project.org/data</a></p>\n<p>Sketch: <a href=\"https://www.sketchapp.com/\" rel=\"nofollow\">https://www.sketchapp.com/</a></p>\n<p>Keynote: <a href=\"https://www.apple.com/keynote/\" rel=\"nofollow\">https://www.apple.com/keynote/</a></p>\n<p>Inkscape: <a href=\"https://inkscape.org/\" rel=\"nofollow\">https://inkscape.org/</a></p>\n</div>",
    "content_md": "\n![Introduction slide](https://res.cloudinary.com/devpost/image/fetch/s--Na6qHAjN--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/cosmos_intro.png)\n\n\n## Inspiration\n\n\nWhen you think big, you might think of our Solar System, or maybe even our galaxy - but our cosmos is far, far more vast than that. Our home galaxy, the Milky Way, hosts hundreds of billions of stars, enough gas to make billions more, and five times more mass in something mysterious, called Dark Matter. At least trillions - that is millions of millions - of galaxies fill up the visible Universe. Together, they form the structure you see now, called the Cosmic Web.\n\n\nSome galaxies, like our Milky Way, live in groups with a few dozen partners. The Milky Way is on a collision course with our nearest neighbour, Andromeda. Don't worry, the collision isn't due for another 4 billion years! But when it happens, it will be spectacular. Groups live in long chains called cosmic filaments, which eventually feed the largest groups, called galaxy clusters. \n\n\n## What it does\n\n\nLook around you. Navigate your way through filaments, groups, and individual galaxies. When you find an interesting object, give it a little attention. If you look long enough, you'll get to zoom in and see it in much more detail, and learn more about that type of object. What do you see? How do the stars, gas and dark matter live in relation to each other?\n\n\n## The Data\n\n\nEvery point you see in this experience is a real data point from the Illustris cosmological simulation. This simulation started with a Universe merely 51 million years old and runs it all the way to the present day, at age 13.7 *billion* years. Astronomers know that in the early days, the Universe was largely very smooth, just one big hot soup of protons, electrons, light particles, and dark matter. If one part of this soup is a little denser, it attracts other parts to it by gravity and grows even denser over time; regions that were less dense in the beginning grow emptier and emptier. As gas gets denser, some of it forms clumps that eventually form stars, and the Universe starts to light up. Finally, by the present day - which we show - the large scale structure looks like a giant web, called the Cosmic Web. The zoom-in at the end takes you to high-resolution data on a single galaxy.\n\n\nThis simulation thus shows our best understanding to date of how the Universe evolves on the largest scales. Urmila published her first academic paper on measuring dark matter distribution in large groups of galaxies (galaxy clusters) by looking at the light from the stars in the cluster galaxies, using this very simulation! Dozens of papers have used this simulation to understand what exactly are the predictions of our current model of dark matter and dark energy, and how these predictions compare to observations. Now, anyone can experience this.\n\n\n## User Experience\n\n\nWe tried to design our experience around the user. We created personas that we wanted to target the experience towards.\n\n\n![Users](https://res.cloudinary.com/devpost/image/fetch/s--N_cCW0bi--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.003.png)\n\n\nThen for each user, we mapped out there \"User Journey\" through our application. We tried to imagine what would be important at each stage for each user. \n\n\n![BobUserStory](https://res.cloudinary.com/devpost/image/fetch/s--aTcicRrk--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.004.png)\n![JessicaUserStory](https://res.cloudinary.com/devpost/image/fetch/s--WOoWCq4A--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.005.png)\n\n\n![AlexUserStory](https://res.cloudinary.com/devpost/image/fetch/s--o3fDxG7b--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/UserJourneys/UserJourneys.006.png)\n\n\nOur conclusion from this study is that we wanted to primarily target an audience like \"Bob\" - someone who doesn't have a lot of technical knowledge already but is interested and wants to have an exciting experience! We also considered expanding this in the future to target researchers like Alex as a secondary audience who might use this for further data analysis that isn't possible in traditional mediums.\n\n\n# Design\n\n\nBased on our user story conclusion we tried to design an experience that would fit our primary audience. Part of this was designing a fun and \"cool\" heads-up-display that would make the user feel like they're in an astronaut's helmet. Part of this design choice was also to counteract the possibility of a nauseating experience caused by flying in space. We also wanted to implement a system on changing helmets to see different types of information such as gas and stars. These designs were first sketched on paper, which is shown below.\n\n\n![Mockup](https://res.cloudinary.com/devpost/image/fetch/s--EN-_tQlf--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/Mockups/Mockups.jpg)\n\n\nNext, the heads-up-display design was implemented using Inkscape and imported to Unity.\n\n\n![hudImage](https://res.cloudinary.com/devpost/image/fetch/s--GjBmm2-p--/c_limit,f_auto,fl_lossy,q_auto:eco,w_900/https://raw.githubusercontent.com/RealityVirtually2019/CosmosVR/master/Mockups/hudImage.png)\n\n\n## Implementation\n\n\nWe downloaded snapshots from the openly accessible Illustris simulation ([www.illustris-project.org/data](http://www.illustris-project.org/data)). Like most astrophysical simulations, this was in HDF5 format. We used Python to select the information we wanted to visualize - density of dark matter and gas, the colors of star particles, and positions for everything - and convert it into .xyz files for Meshlab (<http://www.meshlab.net/>). Meshlab converted these into PLY files, and we found an open-source library to load these into Unity. This gave us our first view of the Universe in 3D!\n\n\nWe then used the Vive SDK to allow users to fly through the simulation using the controllers. \n\n\n## Challenges we ran into\n\n\nLoading the particle data into Unity was a huge challenge! We first considered reading in JSON files and making a ParticleSystem, but couldn't figure out how to do this. The Meshlab workaround really saved the day. \n\n\nRendering the particles was also a challenge. The dataset was so large and we were worried about performance and frame-rate. Luckily we found and utilised a public project that had a custom mesh renderer to visualise a large point cloud (<https://blog.sketchfab.com/tutorial-processing-point-cloud-data-unity/>). \n\n\nWe seem to be having a Unity sound driver issue, so that we can't hear any sounds playing from Unity. We have been working with a mentor to debug this, but unfortunately ran out of time. We would like to expand the interactions to support grab-and-move style locomotion, more advanced selection of objects (galaxy groups, clusters, etc.) using both hand and eye controllers, and an in-depth HUD. For this project we developed a simple \"fly-around\" movement system using the Vive hand controller triggers. \n\n\n## Accomplishments that we're proud of\n\n\nWe thought a lot about the user experience and pedagogical content. We are really proud that we could show an accurate data-set without compromising performance. \n\n\nWe are also really proud that our team (all strangers before this weekend) came together and utilised our diverse skillsets to create a unique and engaging experience! We come from a variety of backgrounds - Astronomy, Biology, UI Research, Design, and Software. \n\n\n## What we learned\n\n\nBeste, Diego and Paul learned about extragalactic astronomy (including the term extragalactic astronomy), the large scale structure of the Universe, and how astronomers simulate and observe the various components of the Universe. Urmila learned to work with HDF5 files instead of relying on other people's highly specialized wrappers. We all got a really deep dive into Unity and the Vive SDK, including how to load in and render large datasets, how to move around the space and various ways to trigger actions. We quickly gelled as team members and worked like a well-oiled machine! \n\n\n## What's next for CosmoVR\n\n\nWe want to add a lot more sound and information to the app to make it a powerful educational tool for consumers at various levels, ranging from curious school kids to scientific researchers. We also want to support more zoom levels and the ability to dynamically change scale without loading new scenes. Since a typical dataset in this space has different time slices we'd also like to visualise how these particles move and change over the course of billions of years. We'd also like to continue implementing our interaction points. \n\n\nOne future work will be to try and port this experience to a standalone headset and prove out the feasibility on a reduced performance hardware platform (like the Oculus Go or GearVR). We believe even a simplified port to a standalone headset could increase adoption in museums and schools who don't want to spend excess resources to drive an HTC Vive.\n\n\n## Resources Used\n\n\n**Unity Assets**\n\n\n<https://assetstore.unity.com/packages/3d/environments/sci-fi/sci-fi-platforms-3d-models-83091> (not used in final project)\n<https://assetstore.unity.com/packages/2d/textures-materials/sky/free-hdr-sky-61217> (not used in final project)\n<https://assetstore.unity.com/packages/2d/textures-materials/sky/urban-night-sky-134468>\n<https://nasa3d.arc.nasa.gov/detail/helmet>\n\n\n**Unity Libraries and Projects**\n\n\n<https://github.com/leon196/PointCloudExporter>\n\n\n<http://wiki.unity3d.com/index.php/SimpleJSON> (not used in final project)\n\n\n**Other Tools**\n\n\nMeshlab: <http://www.meshlab.net/>\n\n\nIllustris: [www.illustris-project.org/data](http://www.illustris-project.org/data)\n\n\nSketch: <https://www.sketchapp.com/>\n\n\nKeynote: <https://www.apple.com/keynote/>\n\n\nInkscape: <https://inkscape.org/>\n\n\n"
}