{
    "source": "https://devpost.com/software/ideatear",
    "title": "Ideate AR",
    "blurb": "A collaboration tool that allows users to physically pull content from devices into a shared holographic workspace",
    "awards": [
        "Best use of Vuforia (PTC)"
    ],
    "videos": [
        "https://www.youtube.com/embed/8NN5uF9-j6Q?enablejsapi=1&hl=en_US&rel=0&start=&version=3&wmode=transparent"
    ],
    "images": [
        {
            "title": "IDEATE AR",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/742/448/datas/original.png"
        },
        {
            "title": "Ideas without boundaries",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/746/060/datas/original.png"
        },
        {
            "title": "Process",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/924/datas/original.JPG"
        },
        {
            "title": "User scenario",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/746/047/datas/original.JPG"
        },
        {
            "title": "Interactions",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/745/936/datas/original.jpg"
        },
        {
            "title": "Demo",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/746/288/datas/original.png"
        },
        {
            "title": "Demo",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/746/292/datas/original.png"
        }
    ],
    "team": [
        {
            "name": "Jacob Shepherd",
            "about": "Director of Product Development with specialization in Disruptive Strategy.  Built the Vuforia Studio integration and the Chrome Extension.",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/000/742/190/datas/profile.jpg"
        },
        {
            "name": "Iris Rodriguez",
            "about": "Interactive and Product Designer passionate about emerging technologies and specialized in MR, AR, and VR experiences. She helped with the design thinking process of the idea, user research and the envisioning of future features.",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/001/206/572/datas/profile.jpg"
        },
        {
            "name": "Kathy Wang",
            "about": "UI/UX Designer, Industrial Designer and 3D modeler.",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/000/742/027/datas/profile.jpeg"
        },
        {
            "name": "Matt Bell",
            "about": "",
            "photo": "https://avatars0.githubusercontent.com/u/4520126?height=180&v=4&width=180"
        },
        {
            "name": "Eliana Mejía",
            "about": "",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/000/742/500/datas/profile.png"
        }
    ],
    "built_with": [
        ".net",
        "autodesk",
        "data-visualization",
        "fidelity",
        "javascript",
        "magic-leap",
        "unity",
        "vuforia"
    ],
    "content_html": "<div>\n<h2>Location</h2>\n<p>Ideate AR - Team #75 - Floor 6 of MIT Media Lab Building E14, Room E14-674 (Purple / MPR), Table: 18 (Back left corner)</p>\n<p>Contact: Jacob Shepherd - 913.626.4777</p>\n<h2>Inspiration</h2>\n<p>When in brainstorming sessions, we see how difficult it is to express ideas, share them or have participative and fluid communication. Everyone shares ideas differently, with different skill sets and forms to approaching problems. Some participants might not be as inspired or not even present in the session, impacting productivity of the team. This can make sessions time consuming and overwhelming.</p>\n<p>Team communication and sketching is the primary tool when brainstorming:  We tend to explain our ideas verbally and support them with visual elements (sketches, images, videos, data, etc..).  The creative flow of the session can be disrupted when participants are not present or they can’t share the idea at the moment quickly and fluid.</p>\n<p>In fact, we came across as a team with this challenge during the hackathon, as other teams did: People from different parts of the world, profiles and experiences came together to ideate a new product experience. How can we make the ideation process more productive and intuitive with the little time that we had?</p>\n<h2>What it does</h2>\n<p><em><strong>Ideate AR</strong></em>\n<em>Give freedom to your ideas</em></p>\n<p>Ideate AR provides a productive and collaborative environment where people can join, be creative and free the imagination. Participants with different skill sets, creative processes and backgrounds, makes the brainstorming activity richer.  With Ideate AR we can augment this ideas and process by transcends traditional mediums of communication - such as paper, whiteboards and screens - in an immersive, multi-user environment making the ideation session more creative and productive.</p>\n<p>Whit Ideate AR you can get inspired and work on your ideas on the go:  Brainstorm different, get creative, collaborate with others and get your ideas to the next level:</p>\n<p>Get inspired and don’t let your ideas go away: Create sketches, sticky notes, record audio notes, upload images, video, 3D models, text and data that you can share on the ideation sessions.</p>\n<p>Join and ideation session where you will be able to connect in real time with other members in a collaborative space, even if they are in another part of the world.</p>\n<p>Share your ideas, brainstorm, collaborate and create in teams. Through seamless device integration and an understanding of the surrounding spaces, see how the ideas grow and creativity takes place.</p>\n<p>Have a better decision making for next steps. Share the outcomes and decision of the ideation process and track the results. For managers, this is a great tool for improve the participation of the team, incorporate innovation processes, align teams and take better decisions.</p>\n<p>Real-time recommendations and summarizations powered by machine learning and artificial intelligence. Users can also track the development of the idea and comeback to brainstorm in a different session or as a personal task in a different moment.</p>\n<p>Anyone with an idea can use Ideate AR: Agencies, Company teams, Students groups, or anyone that has an idea and wants to take it to the next level.</p>\n<h2>How we built it</h2>\n<p>We thought about the concept of ideation and brainstorm itself and how people do it. Also, how this dynamics change when participants have different backgrounds, speaks different languages, have different skills, mindsets, access to resources, and also how this process gets affected when teams are working remotely.</p>\n<p>We created Ideate AR  with the objective of break the boundaries of the physical world when ideating, (ie. sketching, sharing visual elements, taking notes in a notepad, analyze data) and take it to a virtual environment by enhancing the process and making it more productive.  This way we can solve problems of communication during the sessions, provide a better understanding of the ideas and find a better outcomes by working in teams.</p>\n<p>We decided that the best way to accomplish this was by building this collaborative space as an augmented and mixed reality experience in Unity for Magic Leap, in which we can use the  advantages of the spatial computing, allowing us to improve communication and synchronization between multiple users and devices in one session in the same time.</p>\n<p>We studied the user cases were this problems of productivity and ideation happens and how it affects teams productivity and ideas. We analyzed common scenarios and designed the experience having in mind the common pains on which  participants come across with more frequently and how can we  solve them through a better user experience by the use of mixed  reality. </p>\n<p>The experience: </p>\n<p>We took advantage of the technical features provided Magic Leap, Autodesk and Vuforia:</p>\n<ul>\n<li><p>We built a screen enrolment mechanism to allow for laptops and mobile devices to share assets with the Magic Leap through a drag and drop gesture.</p></li>\n<li><p>Added ability to grab and move assets in the collaboration space.</p></li>\n<li><p>Added ability for assets to be relative to a shared point in the environment (nucleus)</p></li>\n<li><p>After the generic communication layer was built, we focused on providing a user interface that could add post-it notes to the app by grabbing and pulling them out of a laptop or mobile device and into the collaboration space. Next, we added the ability for participants to scan print material, such as a product design document, and popped a 3D model that could be pulled out of a mobile device and into the collaboration space.</p></li>\n</ul>\n<p>-We then worked on allowing participants the ability to use AutoDesk’s Forge product to take pictures of a physical object, which could be loaded into the collaboration space. We also added branding elements and physics to items that are in the collaboration space.</p>\n<ul>\n<li>After discussing the need for team members to be able to share data visualizations, we added the ability for a spreadsheet with a 2D graph to turn into a 3D data visualization that could then be added to the collaboration space.</li>\n</ul>\n<h2>Challenges we ran into</h2>\n<p>We came across different type of challenges while building IdeateAR.  We as a team, saw ourselves confronted to the concept of “ideation” and we thought that there must be a better  way to brainstorm. One of the first challenges was on how to represent and abstract concept  like “brainstorming” and  “ideas” in more intuitive way.</p>\n<p>Other challenges was to came across when working with new technologies and pushing ourselves to create in areas we were not too familiar with, more specifically to design and develop experiences in augmented reality and spatial computing.</p>\n<p>When working for IdeateAR, we saw  the importance of the user testing and the way we can introduce a new user to the new medium, and all the user experience problems that emerge when using a new technology as it is with gestures and interactions.</p>\n<p>On the technical side some of the  challenges we ran to was to how to route data through the socket server, the deployment times through iterations to Magic Leap, controlling the tracking on the device, Issues with system slowing to a crawl and needing to be rebooted and overcome the errors were emerging with AutoDesk Forge Reality Capture API.</p>\n<h2>Accomplishments that we are proud of</h2>\n<p>Approaching the design thinking process to enhance it in a way we are making  it more intuitive, imaginative a productive. We were able to work around the implementation of this new technology in our product by testing and learning for the challenges of the user experience and its technical approach.</p>\n<p>One of biggest take away was to learn how to work with people the different points of views, the different backgrounds and skills. It provided a richer way to approach the idea and in consequence the development of the project. We are proud to work in a team so diverse.</p>\n<h2>What we learned</h2>\n<p>How  to work with a this type of technology, with its own design and development challenges:</p>\n<ul>\n<li>Magic Leap</li>\n<li>Vuforia</li>\n<li>Autodesk</li>\n</ul>\n<h2>What's next for IdeateAR</h2>\n<p>A variety of components can be implemented on future iterations of ideateAR:</p>\n<p>Provide pre design sessions for ideation (Empathy maps, product validation)\nConnect other productivity tools (Dropbox, Asana, Trello)</p>\n</div>",
    "content_md": "\n## Location\n\n\nIdeate AR - Team #75 - Floor 6 of MIT Media Lab Building E14, Room E14-674 (Purple / MPR), Table: 18 (Back left corner)\n\n\nContact: Jacob Shepherd - 913.626.4777\n\n\n## Inspiration\n\n\nWhen in brainstorming sessions, we see how difficult it is to express ideas, share them or have participative and fluid communication. Everyone shares ideas differently, with different skill sets and forms to approaching problems. Some participants might not be as inspired or not even present in the session, impacting productivity of the team. This can make sessions time consuming and overwhelming.\n\n\nTeam communication and sketching is the primary tool when brainstorming: We tend to explain our ideas verbally and support them with visual elements (sketches, images, videos, data, etc..). The creative flow of the session can be disrupted when participants are not present or they can’t share the idea at the moment quickly and fluid.\n\n\nIn fact, we came across as a team with this challenge during the hackathon, as other teams did: People from different parts of the world, profiles and experiences came together to ideate a new product experience. How can we make the ideation process more productive and intuitive with the little time that we had?\n\n\n## What it does\n\n\n***Ideate AR***\n*Give freedom to your ideas*\n\n\nIdeate AR provides a productive and collaborative environment where people can join, be creative and free the imagination. Participants with different skill sets, creative processes and backgrounds, makes the brainstorming activity richer. With Ideate AR we can augment this ideas and process by transcends traditional mediums of communication - such as paper, whiteboards and screens - in an immersive, multi-user environment making the ideation session more creative and productive.\n\n\nWhit Ideate AR you can get inspired and work on your ideas on the go: Brainstorm different, get creative, collaborate with others and get your ideas to the next level:\n\n\nGet inspired and don’t let your ideas go away: Create sketches, sticky notes, record audio notes, upload images, video, 3D models, text and data that you can share on the ideation sessions.\n\n\nJoin and ideation session where you will be able to connect in real time with other members in a collaborative space, even if they are in another part of the world.\n\n\nShare your ideas, brainstorm, collaborate and create in teams. Through seamless device integration and an understanding of the surrounding spaces, see how the ideas grow and creativity takes place.\n\n\nHave a better decision making for next steps. Share the outcomes and decision of the ideation process and track the results. For managers, this is a great tool for improve the participation of the team, incorporate innovation processes, align teams and take better decisions.\n\n\nReal-time recommendations and summarizations powered by machine learning and artificial intelligence. Users can also track the development of the idea and comeback to brainstorm in a different session or as a personal task in a different moment.\n\n\nAnyone with an idea can use Ideate AR: Agencies, Company teams, Students groups, or anyone that has an idea and wants to take it to the next level.\n\n\n## How we built it\n\n\nWe thought about the concept of ideation and brainstorm itself and how people do it. Also, how this dynamics change when participants have different backgrounds, speaks different languages, have different skills, mindsets, access to resources, and also how this process gets affected when teams are working remotely.\n\n\nWe created Ideate AR with the objective of break the boundaries of the physical world when ideating, (ie. sketching, sharing visual elements, taking notes in a notepad, analyze data) and take it to a virtual environment by enhancing the process and making it more productive. This way we can solve problems of communication during the sessions, provide a better understanding of the ideas and find a better outcomes by working in teams.\n\n\nWe decided that the best way to accomplish this was by building this collaborative space as an augmented and mixed reality experience in Unity for Magic Leap, in which we can use the advantages of the spatial computing, allowing us to improve communication and synchronization between multiple users and devices in one session in the same time.\n\n\nWe studied the user cases were this problems of productivity and ideation happens and how it affects teams productivity and ideas. We analyzed common scenarios and designed the experience having in mind the common pains on which participants come across with more frequently and how can we solve them through a better user experience by the use of mixed reality. \n\n\nThe experience: \n\n\nWe took advantage of the technical features provided Magic Leap, Autodesk and Vuforia:\n\n\n* We built a screen enrolment mechanism to allow for laptops and mobile devices to share assets with the Magic Leap through a drag and drop gesture.\n* Added ability to grab and move assets in the collaboration space.\n* Added ability for assets to be relative to a shared point in the environment (nucleus)\n* After the generic communication layer was built, we focused on providing a user interface that could add post-it notes to the app by grabbing and pulling them out of a laptop or mobile device and into the collaboration space. Next, we added the ability for participants to scan print material, such as a product design document, and popped a 3D model that could be pulled out of a mobile device and into the collaboration space.\n\n\n-We then worked on allowing participants the ability to use AutoDesk’s Forge product to take pictures of a physical object, which could be loaded into the collaboration space. We also added branding elements and physics to items that are in the collaboration space.\n\n\n* After discussing the need for team members to be able to share data visualizations, we added the ability for a spreadsheet with a 2D graph to turn into a 3D data visualization that could then be added to the collaboration space.\n\n\n## Challenges we ran into\n\n\nWe came across different type of challenges while building IdeateAR. We as a team, saw ourselves confronted to the concept of “ideation” and we thought that there must be a better way to brainstorm. One of the first challenges was on how to represent and abstract concept like “brainstorming” and “ideas” in more intuitive way.\n\n\nOther challenges was to came across when working with new technologies and pushing ourselves to create in areas we were not too familiar with, more specifically to design and develop experiences in augmented reality and spatial computing.\n\n\nWhen working for IdeateAR, we saw the importance of the user testing and the way we can introduce a new user to the new medium, and all the user experience problems that emerge when using a new technology as it is with gestures and interactions.\n\n\nOn the technical side some of the challenges we ran to was to how to route data through the socket server, the deployment times through iterations to Magic Leap, controlling the tracking on the device, Issues with system slowing to a crawl and needing to be rebooted and overcome the errors were emerging with AutoDesk Forge Reality Capture API.\n\n\n## Accomplishments that we are proud of\n\n\nApproaching the design thinking process to enhance it in a way we are making it more intuitive, imaginative a productive. We were able to work around the implementation of this new technology in our product by testing and learning for the challenges of the user experience and its technical approach.\n\n\nOne of biggest take away was to learn how to work with people the different points of views, the different backgrounds and skills. It provided a richer way to approach the idea and in consequence the development of the project. We are proud to work in a team so diverse.\n\n\n## What we learned\n\n\nHow to work with a this type of technology, with its own design and development challenges:\n\n\n* Magic Leap\n* Vuforia\n* Autodesk\n\n\n## What's next for IdeateAR\n\n\nA variety of components can be implemented on future iterations of ideateAR:\n\n\nProvide pre design sessions for ideation (Empathy maps, product validation)\nConnect other productivity tools (Dropbox, Asana, Trello)\n\n\n"
}