{
    "source": "https://devpost.com/software/dare2drive",
    "title": "Dare2Drive",
    "blurb": "A VR game simulating the experience of driving under influences to educate users not to do it in real life.",
    "awards": [],
    "videos": [
        "https://www.youtube.com/embed/2CxLnBtgyJA?enablejsapi=1&hl=en_US&rel=0&start=&version=3&wmode=transparent"
    ],
    "images": [],
    "team": [
        {
            "name": "Zhuohui Li",
            "about": "I proposed the concept and did all the user research. Key contributor to the ideation process. Created the 3D environment and some game elements in unity. ",
            "photo": "https://www.gravatar.com/avatar/19d536f234d334c9f3c5ece511c98b61?d=https%3A%2F%2Fdevpost-challengepost.netdna-ssl.com%2Fassets%2Fdefaults%2Fno-avatar-180.png&s=180"
        },
        {
            "name": "Geyao Zhang",
            "about": "I was the game designer and programmer. I contributed to the game and level design and also in charge of game mechanic programming and 3D modelling. Also helped organizing and time management.",
            "photo": "https://www.gravatar.com/avatar/c73bd33b9cec76faf43312863418dda3?d=https%3A%2F%2Fdevpost-challengepost.netdna-ssl.com%2Fassets%2Fdefaults%2Fno-avatar-180.png&height=180&s=180&width=180"
        },
        {
            "name": "Gregory Osborne",
            "about": "I did all the sound for this project! This included the underscore, the implementation, and all the sound effects.",
            "photo": "https://media.licdn.com/dms/image/C5603AQHwk1WSXIOmOg/profile-displayphoto-shrink_100_100/0?e=1553126400&height=180&t=NdT2C-XpHagGJPFsjXUN4H-L3qzFv5K3ck4CYP3wynE&v=beta&width=180"
        },
        {
            "name": "LINGYU LI",
            "about": "I am a VR developer and I worked on all the VR interaction and part of the game logic for this project! This includes all the related scripts and assets. My job is to  ensure the quality of the interaction and the game flow.\n",
            "photo": "https://media.licdn.com/dms/image/C5603AQHnw8CxWL3Igw/profile-displayphoto-shrink_100_100/0?e=1553126400&height=180&t=tNwTi_aTkhhGAO3zTzx_utunMUhqCE9JLqXcYbA7bvk&v=beta&width=180"
        },
        {
            "name": "Qian Pan",
            "about": "I am UX/UI designer and I worked on the UI interface elements designing and contributed 3D modeling for level design. I am a contributor to the concept development, user flow study;target user/personal establishment/ overall& detail user experience design",
            "photo": "https://avatars0.githubusercontent.com/u/45648716?height=180&v=4&width=180"
        }
    ],
    "built_with": [
        "oculus",
        "unity"
    ],
    "content_html": "<div>\n<h2>Inspiration</h2>\n<p>Driving under the influences of alcohol is one of the main causes of fatal traffic accidents. People are often overconfident about their ability to drive after drinking. They don’t realize how dangerous to drive when their central nervous systems impaired.</p>\n<h2>Statement</h2>\n<p>We wanted to have users virtually experience what it’s like when you drive under the influences of alcohol, marijuana, tiredness, and using mobile devices, in order to show them why they shouldn’t do this in their real lives.</p>\n<p>All of these driving situation are 100% preventable by the drivers. We hope that people will make the appropriate decisions for the safety of themselves and all the others around them on the road before they make the deadly mistake of driving impaired.</p>\n<h2>What it does</h2>\n<p>We designed the whole game as a journey of a senior college student.</p>\n<p>The player is a recently hired employee at a Silicon Valley company, and must get there soon for the first day of work because they lied about their address on their application. However, on the way they stop at their friends house for one last party. Unfortunately our protagonist didn't plan properly, and now they're forced to drive impaired on their way to San Francisco.</p>\n<p>Our driving simulator not only simulates hazards on your way, but adds distractions and simulates the various effects of tiredness, drunkenness, and being high while driving, interfering with your ability to make decisions. Your tiredness requires you to clear your head regularly else your eyes close while you're in the middle of the road. Being drunk removes all the warning sound effects and makes the controls fight you more as you struggle to keep your body and mind responsive. Being high introduces a myriad of distractions that pop up in front of your view, wild thoughts scrolling past your windshield , texts and popups that you must respond to because they block your vision, and a changed color scheme that makes non-relevant objects brighter and shinier while potential hazards are colored grey and harder to notice.</p>\n<p>Unlike some racing games, you are punished for the harm you cause on the environment, ranging from amassed tickets blocking your windshield, a crime meter that knows when you've blown through red lights and run over beloved pets, and the potential to end your life in a crash.</p>\n<p>Most importantly, pulling over for a break is always an option, encouraged to help clear the effects of the impairment, at sacrifice to time but to the benefit of everbody's safety.</p>\n<h2>How we built it</h2>\n<p>Using Unity we first designed a level to drive through, came up with environments, and began working on controls for driving sober, the default experience we would add to for each version of inebriation. We invested time into making the steering wheel animation for your hands seem natural by having your hands snap to the wheel even if you weren't perfectly rotating your hands in a circle. </p>\n<h2>Challenges we ran into</h2>\n<p>In terms of Tech Challenges:</p>\n<p>One issue we had was that not everybody started working in the same version of Unity. 2018.2 and 2018.3 had updates to the prefab functions, which meant that we had to spend a solid chunk of time switching half of our team to an older version of Unity after they'd done a lot of work in the newer ones.</p>\n<p>Our team's technical challenge is mostly about how to make the interactions between the user and the steering wheel feel more natural and intuitive. Since in this hackathon, we are not allowed to use proprietary hardware to support the haptic feedback. What we could exploit is the potential of the Oculus Rift Integration package from the unity asset store to simulate the driver's experience. However, the normal oculus package only shows the basic interaction like picking up objects and throwing them off. Interactions like rotating wheels are off the charts. What's more, there are very limited resources about oculus interactions online. The only useful idea is linked here: (<a href=\"https://forum.unity.com/threads/vr-touch-keeping-hands-rendered-to-a-position-while-rotating-an-object.514530/\" rel=\"nofollow\">https://forum.unity.com/threads/vr-touch-keeping-hands-rendered-to-a-position-while-rotating-an-object.514530/</a>), and those related codes are not open-source. So our main hack is to figure out the way to rotate the steering wheel as we do in real life. After thoroughly scanning and reorganizing the codes of the Oculus package,  I write a series of adapted scripts to implement the single-hand-grip interaction successfully. For now, we are trying to make the two-hands-grip interaction happen and make it by the deadline.</p>\n<p>In terms of Design Challenges:</p>\n<p>We ended up running out of time to complete all the versions of driving impairments, so we chose to focus on one impairment, which was sleepiness, because that involved the least amount of work to get the point across reliably.</p>\n<p>We had to find a delicate balance between the humor of the game, funny music and low poly artstyle with the seriousness of the topic, which involved dangerous behaviours that we didn't want to encourage by making them too fun or rewarding. We wanted to give the option to do the right thing at any time, hence the ability to pull over and take a break to try to wait out the impairments, but we wanted the experience to still involve embodying the poor decision making that would have led to this experience.</p>\n<p>Nevertheless, the experience couldn't be just exhausting, and there had to be a reason to make it to the end in a reasonable amount of time, hence the story that we added to give a little more emotional context to the game and introduce characters you care about protecting.</p>\n<p>We wanted to add a tutorial to introduce those unused to VR to basic concepts before throwing them into a driving simulator, but didn't have the time. Instead we start with narration over sober driving.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are very proud of your ideas. We successfully keep the game both engaging and sensitive to the topic. All of our interactions to indicate the driving impairment are very creative!</p>\n<p>We are also very proud of our steering system, which feels intuitive to use for those who have driven before.</p>\n<h2>What we learned</h2>\n<p>We learned about the importance of starting everybody off using the same versions of their respective programs.</p>\n<p>We learned a lot about designing interactions in VR.</p>\n<p>We learned more about how to balance sound and mixes in VR.</p>\n<h2>What's next for Dare2Drive</h2>\n<p>We hope to finish the other two states of driving impairment to fully complete the original conception of the game. We'd also like to add a tutorial to the beginning to make the experience more accessible to less experienced users of VR. Possibly we could add a story to connect all the different kinds of impairment levels and a conclusion at the end of the game that would take your performance into account more than just numbers of hazards hit.\nWe'd also like to explore the possibility of helping with motion sickness, to experiment and try to find best practices to avoid it, especially in the context of driving in VR.</p>\n<p>If we hit the tone correctly, we could bring this experience to schools as part of the lessons on reducing impaired driving!</p>\n</div>",
    "content_md": "\n## Inspiration\n\n\nDriving under the influences of alcohol is one of the main causes of fatal traffic accidents. People are often overconfident about their ability to drive after drinking. They don’t realize how dangerous to drive when their central nervous systems impaired.\n\n\n## Statement\n\n\nWe wanted to have users virtually experience what it’s like when you drive under the influences of alcohol, marijuana, tiredness, and using mobile devices, in order to show them why they shouldn’t do this in their real lives.\n\n\nAll of these driving situation are 100% preventable by the drivers. We hope that people will make the appropriate decisions for the safety of themselves and all the others around them on the road before they make the deadly mistake of driving impaired.\n\n\n## What it does\n\n\nWe designed the whole game as a journey of a senior college student.\n\n\nThe player is a recently hired employee at a Silicon Valley company, and must get there soon for the first day of work because they lied about their address on their application. However, on the way they stop at their friends house for one last party. Unfortunately our protagonist didn't plan properly, and now they're forced to drive impaired on their way to San Francisco.\n\n\nOur driving simulator not only simulates hazards on your way, but adds distractions and simulates the various effects of tiredness, drunkenness, and being high while driving, interfering with your ability to make decisions. Your tiredness requires you to clear your head regularly else your eyes close while you're in the middle of the road. Being drunk removes all the warning sound effects and makes the controls fight you more as you struggle to keep your body and mind responsive. Being high introduces a myriad of distractions that pop up in front of your view, wild thoughts scrolling past your windshield , texts and popups that you must respond to because they block your vision, and a changed color scheme that makes non-relevant objects brighter and shinier while potential hazards are colored grey and harder to notice.\n\n\nUnlike some racing games, you are punished for the harm you cause on the environment, ranging from amassed tickets blocking your windshield, a crime meter that knows when you've blown through red lights and run over beloved pets, and the potential to end your life in a crash.\n\n\nMost importantly, pulling over for a break is always an option, encouraged to help clear the effects of the impairment, at sacrifice to time but to the benefit of everbody's safety.\n\n\n## How we built it\n\n\nUsing Unity we first designed a level to drive through, came up with environments, and began working on controls for driving sober, the default experience we would add to for each version of inebriation. We invested time into making the steering wheel animation for your hands seem natural by having your hands snap to the wheel even if you weren't perfectly rotating your hands in a circle. \n\n\n## Challenges we ran into\n\n\nIn terms of Tech Challenges:\n\n\nOne issue we had was that not everybody started working in the same version of Unity. 2018.2 and 2018.3 had updates to the prefab functions, which meant that we had to spend a solid chunk of time switching half of our team to an older version of Unity after they'd done a lot of work in the newer ones.\n\n\nOur team's technical challenge is mostly about how to make the interactions between the user and the steering wheel feel more natural and intuitive. Since in this hackathon, we are not allowed to use proprietary hardware to support the haptic feedback. What we could exploit is the potential of the Oculus Rift Integration package from the unity asset store to simulate the driver's experience. However, the normal oculus package only shows the basic interaction like picking up objects and throwing them off. Interactions like rotating wheels are off the charts. What's more, there are very limited resources about oculus interactions online. The only useful idea is linked here: (<https://forum.unity.com/threads/vr-touch-keeping-hands-rendered-to-a-position-while-rotating-an-object.514530/>), and those related codes are not open-source. So our main hack is to figure out the way to rotate the steering wheel as we do in real life. After thoroughly scanning and reorganizing the codes of the Oculus package, I write a series of adapted scripts to implement the single-hand-grip interaction successfully. For now, we are trying to make the two-hands-grip interaction happen and make it by the deadline.\n\n\nIn terms of Design Challenges:\n\n\nWe ended up running out of time to complete all the versions of driving impairments, so we chose to focus on one impairment, which was sleepiness, because that involved the least amount of work to get the point across reliably.\n\n\nWe had to find a delicate balance between the humor of the game, funny music and low poly artstyle with the seriousness of the topic, which involved dangerous behaviours that we didn't want to encourage by making them too fun or rewarding. We wanted to give the option to do the right thing at any time, hence the ability to pull over and take a break to try to wait out the impairments, but we wanted the experience to still involve embodying the poor decision making that would have led to this experience.\n\n\nNevertheless, the experience couldn't be just exhausting, and there had to be a reason to make it to the end in a reasonable amount of time, hence the story that we added to give a little more emotional context to the game and introduce characters you care about protecting.\n\n\nWe wanted to add a tutorial to introduce those unused to VR to basic concepts before throwing them into a driving simulator, but didn't have the time. Instead we start with narration over sober driving.\n\n\n## Accomplishments that we're proud of\n\n\nWe are very proud of your ideas. We successfully keep the game both engaging and sensitive to the topic. All of our interactions to indicate the driving impairment are very creative!\n\n\nWe are also very proud of our steering system, which feels intuitive to use for those who have driven before.\n\n\n## What we learned\n\n\nWe learned about the importance of starting everybody off using the same versions of their respective programs.\n\n\nWe learned a lot about designing interactions in VR.\n\n\nWe learned more about how to balance sound and mixes in VR.\n\n\n## What's next for Dare2Drive\n\n\nWe hope to finish the other two states of driving impairment to fully complete the original conception of the game. We'd also like to add a tutorial to the beginning to make the experience more accessible to less experienced users of VR. Possibly we could add a story to connect all the different kinds of impairment levels and a conclusion at the end of the game that would take your performance into account more than just numbers of hazards hit.\nWe'd also like to explore the possibility of helping with motion sickness, to experiment and try to find best practices to avoid it, especially in the context of driving in VR.\n\n\nIf we hit the tone correctly, we could bring this experience to schools as part of the lessons on reducing impaired driving!\n\n\n"
}