{
    "source": "https://devpost.com/software/stretchxr-a-virtualized-pain-management-therapy",
    "title": "StretchXR - A Virtualized Pain Management Therapy",
    "blurb": "StretchXR offers clinicians a modern, safe, non-invasive approach to chronic pain therapy for patients -- drug Free!",
    "awards": [],
    "videos": [
        "https://www.youtube.com/embed/VCpv0iEljNU?enablejsapi=1&hl=en_US&rel=0&start=&version=3&wmode=transparent"
    ],
    "images": [
        {
            "title": "An Immersive VR-based Embodiment Therapy for Chronic Back Pain",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/746/433/datas/original.png"
        }
    ],
    "team": [
        {
            "name": "Brandon Birckhead",
            "about": "Came up with the idea for the program based on medical literature and experience. Led story boarding of the intervention.",
            "photo": "https://avatars0.githubusercontent.com/u/24922385?height=180&v=4&width=180"
        },
        {
            "name": "Michelle Juárez",
            "about": "",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/000/745/219/datas/profile.jpg"
        },
        {
            "name": "Erika Gangware",
            "about": "",
            "photo": "https://avatars1.githubusercontent.com/u/41128488?height=180&v=4&width=180"
        },
        {
            "name": "annamufa Muñoz Farré",
            "about": "",
            "photo": "https://avatars0.githubusercontent.com/u/38862917?height=180&v=4&width=180"
        },
        {
            "name": "deborahnavarro",
            "about": "",
            "photo": "https://avatars3.githubusercontent.com/u/15136688?height=180&v=4&width=180"
        },
        {
            "name": "masternader",
            "about": "",
            "photo": "https://avatars2.githubusercontent.com/u/41163985?height=180&v=4&width=180"
        }
    ],
    "built_with": [
        "leap-motion",
        "unity"
    ],
    "content_html": "<div>\n<h2>Inspiration</h2>\n<p>We are a team of developers, researchers, and entrepreneurs with a common interest in health and wellness. We were moved by the potential of fully immersive therapies through VR for the relief of chronic physical pain. To begin this journey, we decided to target patients who suffer from chronic lower back pain, as it accounts for over 10% of the population. It is also the most diagnosed chronic physical pain and the most common source of long-term opiate prescription use. Our project pairs physical therapy with visual therapy to form unique treatments for patients. The near-term goal is to characterize the effectiveness of this technique, extending further research into VR-based pain alleviation therapies. We aim to direct the evolution of novel applications of VR/AR technology in medicine and meditation, with the ultimate goal of the deployment of accessible, cost-effective, therapeutic immersive experiences for the reduction of drug dependency among affected populations, improving the overall long-term quality of life among chronic pain sufferers.</p>\n<h2>Background</h2>\n<p>The objective of this project is to explore the therapeutic viability of embodiment experiences in a VR setting with a virtualized avatar body, as applied to alleviate chronic lower back pain. We instruct the subject to stretch their arms outward, triggering an elongation of the lower torso. </p>\n<p>Prior to entering the virtual environment, subjects are fitted with the Woojer strap to provide synchronized haptic feedback with calming, ambient music for the duration of the virtual experience. Once the user enters the virtual environment, the experience opens with the subject finding themselves on a patch of grass with a clear, open sky and a virtualized mirror. The subject is able to visualize their surrogate self in the virtualized mirror and is made aware of their surrogate hands. Once sufficient time has passed to allow for the subject to acclimate to the avatar (~10 seconds), the subject is instructed to perform gentle, flowing arm movements that affect therapeutic reduction of pain during the experience. In this case, the actions trigger modifications to the morphology of the subject’s torso through the elongation of the avatar’s spine, which is observable to the subject in the virtual mirror. The elongation of the torso gradually increases with every successive movement. Techniques that enhance the efficacy or suggestibility of the embodiment experience have been explored, but a significant degree of immersion is accomplished through the subject’s interaction with their surrogate reflection. </p>\n<p>Recent pilot studies (n=19) have reported pain scores reduced by up to 50% in cases of compartmental regional pain syndrome (CRPS type I and II), peripheral neuropathy injury (PNI), and an array of other chronic and acute cases of pain experience.</p>\n<h2>Abstract</h2>\n<p>Over 84% of adults in the US have suffered from lower back at some point in their lives (Carey et al., 2009). Pain that continues for greater than 12 weeks is considered chronic pain. Millions of individuals live with chronic lower back pain, and inappropriately-prescribed opioids long term, a class of medications that may provide effective analgesia but can lead to opioid use disorder, opioid-related overdoses and serious adverse events, including death. It is vital to identify opioid-free treatments to assist in the management of chronic pain. This intervention was developed to give patients the illusion of body ownership with a virtual avatar. The patient will then undergo therapeutic maneuvers and virtual torso elongation to create an analgesic effect based on previous research. </p>\n<h2>Value Proposition:</h2>\n<ul>\n<li>Pain reduction through guided physical therapeutic movement </li>\n<li>Pain reduction through elongation and expansion visualization</li>\n<li>Pain reduction through immersive virtual environment</li>\n<li>Pain reduction through sound therapy</li>\n</ul>\n<h2>Targeted Market</h2>\n<ul>\n<li>Medical professionals </li>\n<li>Hospitals </li>\n<li>Research Institutions </li>\n</ul>\n<h2>Targeted Users</h2>\n<p>We are targeting patients with chronic lower back pain who are in the 30-50 year old range and have mobility. Isolating a target demographic will allow us to collect comparable data. </p>\n<h2>Goal:</h2>\n<p>We intend to run clinical trials using the VR-CORE guidelines. This would include a VR1 study which includes further development using patient centered design via focus groups. This will be followed by  a VR2 study which is used to assess the acceptability from the patient and feasibility of using the device within a clinical setting. Finalized a VR3 study will be done to assess the efficacious of the intervention vs an active control. Previous research has shown approximately 20-25% reduction in pain using a VR intervention in a variety of situations. Further studies will explore the percent reduction within this specific patient population. . </p>\n<h2>What’s Next?</h2>\n<p>We aim to add an array of capabilities we envisioned but were not able to include in our MVP (demo) due to the short-term time-frame of the hackathon. Once our experience is complete, a researcher and M.D. on our team, who presented the idea for the project, aims to use it in clinical trials to treat chronic pain patients in outpatient pain clinics. Pain medicine practices are growing as the opiate epidemic continues to rise. This serves as one way to help alleviate one source of the problem. This mechanism for VR therapy could also be used for preventing patients from going on opioids, by adding this to acute pain regiments.  </p>\n<h2>How we built it</h2>\n<p>The team logo was designed in Adobe Illustrator. To provide haptic feedback during the experience, users are fitted with a Woojer strap. This strap is synchronized to ambient music that plays within the virtual environment. The background music was taken from a royalty-free music site <a href=\"http://jamen.do/t/365392\" rel=\"nofollow\">http://jamen.do/t/365392</a> - “Stellar” by Fortadelis. The first asset that was placed in the scene was the mirror. Then the avatar was created using Rhino3D. The main animation that was created was the elongation of the torso of the avatar. The animation was made within Unity3D.  The key action within the program is reflection of the virtual body within the mirror. The shader of the mirror was modified to allow correct visualization of the avatar. We then created an audio script using online-voice-recorder.com, which initiates about 10 seconds into the experience, to allow time for the subject to place the HMD on their head and acclimate to the environment. This audio script instructs the participant to touch a button with their hands to start the exercise. The core of the experience was built in Unity using HTC Vive Pro and Leap Motion hand trackers. Leap Motion was used to provide humanoid upper extremities with accurate tracking of hands. The scene was taken from the unity asset store. </p>\n<h2>Challenges we ran into</h2>\n<p>We initially attempted to use Intel RealSense depth cameras to perform real-time body-tracking; however, we eventually discovered that we needed to use a paid version of OpenCV plugin for Unity to implement use of the sensor.</p>\n<p>Though virtual embodiment is most effect with a humanoid avatar with full body tracking, we could not incorporate leg tracking (due to the body-tracking issue previously-mentioned). As a result, we decided to design the experience as a stationary exercise through a sequence of repetitive arm movements. Additionally, we encountered issues with adding arms to the avatar. The mirror also has issues reflecting the virtual body with the current shader that it came with. It required further modifications.</p>\n<p>A considerable amount of time was spent correcting issues with Git LFS when making commits to the repository (to ensure that all team members were able to successfully commit to it).</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We came together around a passion to help patients based by medical VR research. During our first day we focused on the most important feature of the intervention. This was also a great learning experience for all of us. </p>\n<h2>Literature behind the intervention</h2>\n<p>Several papers were instrumental in the development of the intervention. Rosink et al. demonstrated that a projector-based VR experience could be used to help understand body perception in those with chronic lower back pain (Roosink et al., 2015). We then incorporated elongation based on inspiration from a paper from Dr. Mel Slater, which demonstrated a sense of presence with a limb three times its original size(Kilteni, Normand, Sanchez-Vives, &amp; Slater, 2012).  Dr. Maria V. Sanchez-Vives recently published a brilliant pilot study using virtual embodiment and modifications of both size and opacification of upper extremity to treat chronic pain(Matamala-Gomez, Gonzalez, Slater, &amp; Sanchez-Vives, 2018). Virtual embodiment is the process of causing the illusion of body ownership to a virtual avatar using visuomotor synchrony and a virtual mirror. Recently a randomized trial published in the journal Neurology demonstrating mild analgesia using virtual embodiment for neuropathic pain from a spinal injury(Pozeg et al., 2017). We also incorporated a back exercise based on several papers demonstrated benefit with VR based physical therapy(Thomas, France, Applegate, Leitkam, &amp; Walkowski, 2016)(Trost et al., 2015).</p>\n<h2>Team</h2>\n<p><strong>Brandon Birckhead MD, Principal Investigator</strong>: I am the Co-Chair of the Virtual Medicine Conference at Cedars-Sinai Medical Center and currently running a large randomized clinical trial for chronic pain. I have designed two VR programs one for dental anxiety and one for breast cancer education. I have also designed several clinical studies: randomized VR pain study using the cold pressor test, randomized breast cancer patient education, and taken part in the creation of guidelines for immersive therapeutic clinical trials along with a cohort of international therapeutic VR experts, called the VR-CORE (Virtual Reality – Clinical Outcomes Research Experts). I had advised several physicians and medical students in the development process of VR clinical trials. </p>\n<p><strong>Erika Gangware, 3D Designer and Unity Developer</strong>. I am a 3D Product Designer and a Unity Developer working primarily on mobile and vive platforms. As a 3D designer I have made biomedical renderings in the oncology space and use 3D software to render anatomical models. As a Unity Developer I have worked on biomedical VR files that aim to improve provider workflow, and plan to design and develop files that improve patient outcomes.</p>\n<p><strong>Deborah Navarro M.S., Visionary &amp; Strategist</strong>: I am a Product Manager and Hyperloop Business Leader. I founded a research group/startup consisting of engineers from UT and MIT.  Together, we took home the Innovation award at SpaceX’s Hyperloop Pod Comp II for our breakthroughs in air-levitation. I have a background in biological sciences, technology commercialization, and engineering. I aim to augment the relationship between tech, sustainability, and artificial intelligence by building products that are mindful of their position in the world and implement them in a way that allows them to connect people. I am exploring how AR/VR can help achieve this. </p>\n<p><strong>Anna Muñoz-Farré Biomedical Engineer:</strong> I am a Research Affiliate at Massachusetts Institute of Technology, where I developed my MS thesis in the area of cardiology. I focus in product development, and I been in research and collaborated with different hospitals, both in Boston and Barcelona, Spain. I am passionate about how technology will change the way we treat illnesses. </p>\n<p><strong>Michelle Juárez, Principal Systems Engineer - Applied Research:</strong> I’m a Systems Engineer in the aerospace industry, focusing on applied research and development, modeling and simulation, system design, and radar analysis. I have a background in research in algorithm development and medical image analysis of fMRI brain data, and am currently collaborating on a side project for the development of a novel, holographic heads-up display for vehicles. I am passionate about physics/astronomy/data analytics/biotech/disruptive technologies, and am eager to explore innovating my career in AR/VR/XR development.</p>\n<p><strong>Nader Shokair Research Scientist</strong>, B.A./Pre-Med PostBacc - Research Scientist: I am a premed student with an expertise in physical sciences; namely, optical systems, holography, and analog circuit applications of low-level circuit logic, along with material fabrication and engineering. I enjoy a multifarious set of academic and personal ambitions. My undergraduate degree is in philosophy with an emphasis on cognitive science and ethics. I am passionate about technology, particularly machine learning/CNNs and computer vision and believe the future of medicine will be built upon AR/VR/XR. My passions include a range of motorsports from motoX to wheel-to-wheel road racing and have been working on my own race car project for over 10 years. Using this as a platform I hope to explore the technical problems surrounding the design of HMD-free holography in the  controlled space of a vehicle cockpit, to then expand into the clinical settings I wish to see develop into full XR patient/doctor experiences.\n<strong>Erika Gangware Unity Developer and 3D Designer:</strong><br/></p>\n<h2>What we learned</h2>\n<p>Leap motion\nAnimation\nShaders for reflective mirrors</p>\n<h2>What's next for StretchXR?</h2>\n<p>We aim to add an array of capabilities we envisioned but were not able to include in our MVP (demo) due to the limited time-frame of the hackathon. Once our experience is complete, a researcher and M.D. on our team, who presented the idea for the project, aims to use it in clinical trials to treat chronic pain patients in outpatient pain clinics. Pain medicine practices are growing as the opiate epidemic continues to rise. This serves as one way to help alleviate one source of the problem. This mechanism for VR therapy could also be used for preventing patients from going on opiods, by adding this to acute pain regiments</p>\n<h2>References</h2>\n<p>Carey, T. S., Freburger, J. K., Holmes, G. M., Castel, L., Darter, J., Agans, R., … Jackman, A. (2009). A long way to go: practice patterns and evidence in chronic low back pain care. Spine, 34(7), 718–724. <a href=\"https://doi.org/10.1097/BRS.0b013e31819792b0\" rel=\"nofollow\">https://doi.org/10.1097/BRS.0b013e31819792b0</a>\nKilteni, K., Normand, J.-M., Sanchez-Vives, M. V., &amp; Slater, M. (2012). Extending Body Space in Immersive Virtual Reality: A Very Long Arm Illusion. PLoS ONE, 7(7), e40867. <a href=\"https://doi.org/10.1371/journal.pone.0040867\" rel=\"nofollow\">https://doi.org/10.1371/journal.pone.0040867</a>\nMatamala-Gomez, M., Gonzalez, A. M. D., Slater, M., &amp; Sanchez-Vives, M. V. (2018). Decreasing pain ratings in chronic arm pain through changing a virtual body: different strategies for different pain types. The Journal of Pain : Official Journal of the American Pain Society, 0(0). <a href=\"https://doi.org/10.1016/j.jpain.2018.12.001\" rel=\"nofollow\">https://doi.org/10.1016/j.jpain.2018.12.001</a>\nPozeg, P., Palluel, E., Ronchi, R., Solcà, M., Al-Khodairy, A.-W., Jordan, X., … Blanke, O. (2017). Virtual reality improves embodiment and neuropathic pain caused by spinal cord injury. Neurology, 89(18), 1894–1903. <a href=\"https://doi.org/10.1212/WNL.0000000000004585\" rel=\"nofollow\">https://doi.org/10.1212/WNL.0000000000004585</a>\nRoosink, M., McFadyen, B. J., Hébert, L. J., Jackson, P. L., Bouyer, L. J., &amp; Mercier, C. (2015). Assessing the Perception of Trunk Movements in Military Personnel with Chronic Non-Specific Low Back Pain Using a Virtual Mirror. PLOS ONE, 10(3), e0120251. <a href=\"https://doi.org/10.1371/journal.pone.0120251\" rel=\"nofollow\">https://doi.org/10.1371/journal.pone.0120251</a>\nThomas, J. S., France, C. R., Applegate, M. E., Leitkam, S. T., &amp; Walkowski, S. (2016). Feasibility and Safety of a Virtual Reality Dodgeball Intervention for Chronic Low Back Pain: A Randomized Clinical Trial. The Journal of Pain, 17(12), 1302–1317. <a href=\"https://doi.org/10.1016/j.jpain.2016.08.011\" rel=\"nofollow\">https://doi.org/10.1016/j.jpain.2016.08.011</a>\nTrost, Z., Zielke, M., Guck, A., Nowlin, L., Zakhidov, D., France, C. R., &amp; Keefe, F. (2015). The promise and challenge of virtual gaming technologies for chronic pain: the case of graded exposure for low back pain. Pain Management, 5(3), 197–206. <a href=\"https://doi.org/10.2217/pmt.15.6\" rel=\"nofollow\">https://doi.org/10.2217/pmt.15.6</a></p>\n</div>",
    "content_md": "\n## Inspiration\n\n\nWe are a team of developers, researchers, and entrepreneurs with a common interest in health and wellness. We were moved by the potential of fully immersive therapies through VR for the relief of chronic physical pain. To begin this journey, we decided to target patients who suffer from chronic lower back pain, as it accounts for over 10% of the population. It is also the most diagnosed chronic physical pain and the most common source of long-term opiate prescription use. Our project pairs physical therapy with visual therapy to form unique treatments for patients. The near-term goal is to characterize the effectiveness of this technique, extending further research into VR-based pain alleviation therapies. We aim to direct the evolution of novel applications of VR/AR technology in medicine and meditation, with the ultimate goal of the deployment of accessible, cost-effective, therapeutic immersive experiences for the reduction of drug dependency among affected populations, improving the overall long-term quality of life among chronic pain sufferers.\n\n\n## Background\n\n\nThe objective of this project is to explore the therapeutic viability of embodiment experiences in a VR setting with a virtualized avatar body, as applied to alleviate chronic lower back pain. We instruct the subject to stretch their arms outward, triggering an elongation of the lower torso. \n\n\nPrior to entering the virtual environment, subjects are fitted with the Woojer strap to provide synchronized haptic feedback with calming, ambient music for the duration of the virtual experience. Once the user enters the virtual environment, the experience opens with the subject finding themselves on a patch of grass with a clear, open sky and a virtualized mirror. The subject is able to visualize their surrogate self in the virtualized mirror and is made aware of their surrogate hands. Once sufficient time has passed to allow for the subject to acclimate to the avatar (~10 seconds), the subject is instructed to perform gentle, flowing arm movements that affect therapeutic reduction of pain during the experience. In this case, the actions trigger modifications to the morphology of the subject’s torso through the elongation of the avatar’s spine, which is observable to the subject in the virtual mirror. The elongation of the torso gradually increases with every successive movement. Techniques that enhance the efficacy or suggestibility of the embodiment experience have been explored, but a significant degree of immersion is accomplished through the subject’s interaction with their surrogate reflection. \n\n\nRecent pilot studies (n=19) have reported pain scores reduced by up to 50% in cases of compartmental regional pain syndrome (CRPS type I and II), peripheral neuropathy injury (PNI), and an array of other chronic and acute cases of pain experience.\n\n\n## Abstract\n\n\nOver 84% of adults in the US have suffered from lower back at some point in their lives (Carey et al., 2009). Pain that continues for greater than 12 weeks is considered chronic pain. Millions of individuals live with chronic lower back pain, and inappropriately-prescribed opioids long term, a class of medications that may provide effective analgesia but can lead to opioid use disorder, opioid-related overdoses and serious adverse events, including death. It is vital to identify opioid-free treatments to assist in the management of chronic pain. This intervention was developed to give patients the illusion of body ownership with a virtual avatar. The patient will then undergo therapeutic maneuvers and virtual torso elongation to create an analgesic effect based on previous research. \n\n\n## Value Proposition:\n\n\n* Pain reduction through guided physical therapeutic movement\n* Pain reduction through elongation and expansion visualization\n* Pain reduction through immersive virtual environment\n* Pain reduction through sound therapy\n\n\n## Targeted Market\n\n\n* Medical professionals\n* Hospitals\n* Research Institutions\n\n\n## Targeted Users\n\n\nWe are targeting patients with chronic lower back pain who are in the 30-50 year old range and have mobility. Isolating a target demographic will allow us to collect comparable data. \n\n\n## Goal:\n\n\nWe intend to run clinical trials using the VR-CORE guidelines. This would include a VR1 study which includes further development using patient centered design via focus groups. This will be followed by a VR2 study which is used to assess the acceptability from the patient and feasibility of using the device within a clinical setting. Finalized a VR3 study will be done to assess the efficacious of the intervention vs an active control. Previous research has shown approximately 20-25% reduction in pain using a VR intervention in a variety of situations. Further studies will explore the percent reduction within this specific patient population. . \n\n\n## What’s Next?\n\n\nWe aim to add an array of capabilities we envisioned but were not able to include in our MVP (demo) due to the short-term time-frame of the hackathon. Once our experience is complete, a researcher and M.D. on our team, who presented the idea for the project, aims to use it in clinical trials to treat chronic pain patients in outpatient pain clinics. Pain medicine practices are growing as the opiate epidemic continues to rise. This serves as one way to help alleviate one source of the problem. This mechanism for VR therapy could also be used for preventing patients from going on opioids, by adding this to acute pain regiments. \n\n\n## How we built it\n\n\nThe team logo was designed in Adobe Illustrator. To provide haptic feedback during the experience, users are fitted with a Woojer strap. This strap is synchronized to ambient music that plays within the virtual environment. The background music was taken from a royalty-free music site <http://jamen.do/t/365392> - “Stellar” by Fortadelis. The first asset that was placed in the scene was the mirror. Then the avatar was created using Rhino3D. The main animation that was created was the elongation of the torso of the avatar. The animation was made within Unity3D. The key action within the program is reflection of the virtual body within the mirror. The shader of the mirror was modified to allow correct visualization of the avatar. We then created an audio script using online-voice-recorder.com, which initiates about 10 seconds into the experience, to allow time for the subject to place the HMD on their head and acclimate to the environment. This audio script instructs the participant to touch a button with their hands to start the exercise. The core of the experience was built in Unity using HTC Vive Pro and Leap Motion hand trackers. Leap Motion was used to provide humanoid upper extremities with accurate tracking of hands. The scene was taken from the unity asset store. \n\n\n## Challenges we ran into\n\n\nWe initially attempted to use Intel RealSense depth cameras to perform real-time body-tracking; however, we eventually discovered that we needed to use a paid version of OpenCV plugin for Unity to implement use of the sensor.\n\n\nThough virtual embodiment is most effect with a humanoid avatar with full body tracking, we could not incorporate leg tracking (due to the body-tracking issue previously-mentioned). As a result, we decided to design the experience as a stationary exercise through a sequence of repetitive arm movements. Additionally, we encountered issues with adding arms to the avatar. The mirror also has issues reflecting the virtual body with the current shader that it came with. It required further modifications.\n\n\nA considerable amount of time was spent correcting issues with Git LFS when making commits to the repository (to ensure that all team members were able to successfully commit to it).\n\n\n## Accomplishments that we're proud of\n\n\nWe came together around a passion to help patients based by medical VR research. During our first day we focused on the most important feature of the intervention. This was also a great learning experience for all of us. \n\n\n## Literature behind the intervention\n\n\nSeveral papers were instrumental in the development of the intervention. Rosink et al. demonstrated that a projector-based VR experience could be used to help understand body perception in those with chronic lower back pain (Roosink et al., 2015). We then incorporated elongation based on inspiration from a paper from Dr. Mel Slater, which demonstrated a sense of presence with a limb three times its original size(Kilteni, Normand, Sanchez-Vives, & Slater, 2012). Dr. Maria V. Sanchez-Vives recently published a brilliant pilot study using virtual embodiment and modifications of both size and opacification of upper extremity to treat chronic pain(Matamala-Gomez, Gonzalez, Slater, & Sanchez-Vives, 2018). Virtual embodiment is the process of causing the illusion of body ownership to a virtual avatar using visuomotor synchrony and a virtual mirror. Recently a randomized trial published in the journal Neurology demonstrating mild analgesia using virtual embodiment for neuropathic pain from a spinal injury(Pozeg et al., 2017). We also incorporated a back exercise based on several papers demonstrated benefit with VR based physical therapy(Thomas, France, Applegate, Leitkam, & Walkowski, 2016)(Trost et al., 2015).\n\n\n## Team\n\n\n**Brandon Birckhead MD, Principal Investigator**: I am the Co-Chair of the Virtual Medicine Conference at Cedars-Sinai Medical Center and currently running a large randomized clinical trial for chronic pain. I have designed two VR programs one for dental anxiety and one for breast cancer education. I have also designed several clinical studies: randomized VR pain study using the cold pressor test, randomized breast cancer patient education, and taken part in the creation of guidelines for immersive therapeutic clinical trials along with a cohort of international therapeutic VR experts, called the VR-CORE (Virtual Reality – Clinical Outcomes Research Experts). I had advised several physicians and medical students in the development process of VR clinical trials. \n\n\n**Erika Gangware, 3D Designer and Unity Developer**. I am a 3D Product Designer and a Unity Developer working primarily on mobile and vive platforms. As a 3D designer I have made biomedical renderings in the oncology space and use 3D software to render anatomical models. As a Unity Developer I have worked on biomedical VR files that aim to improve provider workflow, and plan to design and develop files that improve patient outcomes.\n\n\n**Deborah Navarro M.S., Visionary & Strategist**: I am a Product Manager and Hyperloop Business Leader. I founded a research group/startup consisting of engineers from UT and MIT. Together, we took home the Innovation award at SpaceX’s Hyperloop Pod Comp II for our breakthroughs in air-levitation. I have a background in biological sciences, technology commercialization, and engineering. I aim to augment the relationship between tech, sustainability, and artificial intelligence by building products that are mindful of their position in the world and implement them in a way that allows them to connect people. I am exploring how AR/VR can help achieve this. \n\n\n**Anna Muñoz-Farré Biomedical Engineer:** I am a Research Affiliate at Massachusetts Institute of Technology, where I developed my MS thesis in the area of cardiology. I focus in product development, and I been in research and collaborated with different hospitals, both in Boston and Barcelona, Spain. I am passionate about how technology will change the way we treat illnesses. \n\n\n**Michelle Juárez, Principal Systems Engineer - Applied Research:** I’m a Systems Engineer in the aerospace industry, focusing on applied research and development, modeling and simulation, system design, and radar analysis. I have a background in research in algorithm development and medical image analysis of fMRI brain data, and am currently collaborating on a side project for the development of a novel, holographic heads-up display for vehicles. I am passionate about physics/astronomy/data analytics/biotech/disruptive technologies, and am eager to explore innovating my career in AR/VR/XR development.\n\n\n**Nader Shokair Research Scientist**, B.A./Pre-Med PostBacc - Research Scientist: I am a premed student with an expertise in physical sciences; namely, optical systems, holography, and analog circuit applications of low-level circuit logic, along with material fabrication and engineering. I enjoy a multifarious set of academic and personal ambitions. My undergraduate degree is in philosophy with an emphasis on cognitive science and ethics. I am passionate about technology, particularly machine learning/CNNs and computer vision and believe the future of medicine will be built upon AR/VR/XR. My passions include a range of motorsports from motoX to wheel-to-wheel road racing and have been working on my own race car project for over 10 years. Using this as a platform I hope to explore the technical problems surrounding the design of HMD-free holography in the controlled space of a vehicle cockpit, to then expand into the clinical settings I wish to see develop into full XR patient/doctor experiences.\n**Erika Gangware Unity Developer and 3D Designer:**  \n\n\n\n## What we learned\n\n\nLeap motion\nAnimation\nShaders for reflective mirrors\n\n\n## What's next for StretchXR?\n\n\nWe aim to add an array of capabilities we envisioned but were not able to include in our MVP (demo) due to the limited time-frame of the hackathon. Once our experience is complete, a researcher and M.D. on our team, who presented the idea for the project, aims to use it in clinical trials to treat chronic pain patients in outpatient pain clinics. Pain medicine practices are growing as the opiate epidemic continues to rise. This serves as one way to help alleviate one source of the problem. This mechanism for VR therapy could also be used for preventing patients from going on opiods, by adding this to acute pain regiments\n\n\n## References\n\n\nCarey, T. S., Freburger, J. K., Holmes, G. M., Castel, L., Darter, J., Agans, R., … Jackman, A. (2009). A long way to go: practice patterns and evidence in chronic low back pain care. Spine, 34(7), 718–724. <https://doi.org/10.1097/BRS.0b013e31819792b0>\nKilteni, K., Normand, J.-M., Sanchez-Vives, M. V., & Slater, M. (2012). Extending Body Space in Immersive Virtual Reality: A Very Long Arm Illusion. PLoS ONE, 7(7), e40867. <https://doi.org/10.1371/journal.pone.0040867>\nMatamala-Gomez, M., Gonzalez, A. M. D., Slater, M., & Sanchez-Vives, M. V. (2018). Decreasing pain ratings in chronic arm pain through changing a virtual body: different strategies for different pain types. The Journal of Pain : Official Journal of the American Pain Society, 0(0). <https://doi.org/10.1016/j.jpain.2018.12.001>\nPozeg, P., Palluel, E., Ronchi, R., Solcà, M., Al-Khodairy, A.-W., Jordan, X., … Blanke, O. (2017). Virtual reality improves embodiment and neuropathic pain caused by spinal cord injury. Neurology, 89(18), 1894–1903. <https://doi.org/10.1212/WNL.0000000000004585>\nRoosink, M., McFadyen, B. J., Hébert, L. J., Jackson, P. L., Bouyer, L. J., & Mercier, C. (2015). Assessing the Perception of Trunk Movements in Military Personnel with Chronic Non-Specific Low Back Pain Using a Virtual Mirror. PLOS ONE, 10(3), e0120251. <https://doi.org/10.1371/journal.pone.0120251>\nThomas, J. S., France, C. R., Applegate, M. E., Leitkam, S. T., & Walkowski, S. (2016). Feasibility and Safety of a Virtual Reality Dodgeball Intervention for Chronic Low Back Pain: A Randomized Clinical Trial. The Journal of Pain, 17(12), 1302–1317. <https://doi.org/10.1016/j.jpain.2016.08.011>\nTrost, Z., Zielke, M., Guck, A., Nowlin, L., Zakhidov, D., France, C. R., & Keefe, F. (2015). The promise and challenge of virtual gaming technologies for chronic pain: the case of graded exposure for low back pain. Pain Management, 5(3), 197–206. <https://doi.org/10.2217/pmt.15.6>\n\n\n"
}