{
    "source": "https://devpost.com/software/brain-drain-the-academic-adventure-to-save-the-world",
    "title": "Brain Drain-The Academic Adventure to Save the World!",
    "blurb": "Are you ready to join the Revolution?",
    "awards": [
        "Best Use of Eye Tracking [Sponsored by HTC Vive]"
    ],
    "videos": [
        "https://player.vimeo.com/video/385864626?byline=0&portrait=0&title=0#t="
    ],
    "images": [],
    "team": [
        {
            "name": "Rebecca Gill Clarke",
            "about": "I worked on the visual design of the game and led some initial UX exercises to get the project started.",
            "photo": "https://avatars2.githubusercontent.com/u/39564891?height=180&v=4&width=180"
        },
        {
            "name": "Joshua Marris",
            "about": "I managed logistics, game logic and hardware troubleshooting.",
            "photo": "https://avatars2.githubusercontent.com/u/6978629?height=180&v=4&width=180"
        },
        {
            "name": "Shannon Putman",
            "about": "",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/000/918/137/datas/profile.jpg"
        },
        {
            "name": "Jennifer Swann",
            "about": "",
            "photo": "https://media.licdn.com/dms/image/C4E03AQFUZFKnweHNEA/profile-displayphoto-shrink_100_100/0?e=1532563200&height=180&t=aV_KoxSBxOutIhS9Gl1Yf-HE03MMgh-bZLAhQL8shbo&v=beta&width=180"
        }
    ],
    "built_with": [
        "c#",
        "unity"
    ],
    "content_html": "<div>\n<h2>Inspiration:</h2>\n<p>There were two related but distinct inspirations behind Brain Drain. I have spent 13 years working as an educator and observing firsthand the desperate need for a change. As a society we are failing our students by refusing to update our educational practices. We need to stop trying to change the way they learn and start changing the way we teach. </p>\n<p>As a special education teacher, I would watch my students fight and struggle to find a way to gain access to the curriculum equal to their general education peers. A new app would come out that “improved scores by so many percentage points” but it required the user to listen to prompts. My students who are deaf could not play that. Another new app would debut, but that one would require students to manipulate small numbers on the screen or type numbers in under a certain time. That eliminated my students with underdeveloped fine motor skills. The next “academic game” hits the market, and this one finally makes learning fun. In order to do that however, you have to visually sift through a massive array of information whilst multiple rounds of distracting noises are pummeling you. There goes the access for my students with Autism Spectrum Disorder.</p>\n<p>During the course of development, specific and intentional decisions were made so that this game will be played by students of all ability levels. Utilizing the latest technology including eye tracking, this game is engaging for all students. When we harness the power of VR we are only limited by our imaginations, and students who were left out of participating in the past due to wheelchairs, lack of fine motor skills, non-verbal communication, finally have an experience designed with them in mind. The best part about making those specific decisions is that it forced us to create new and inventive ways of responding to academic questions, and come to find out, those ways are fun for all kids.</p>\n<h2>What it does:</h2>\n<p>Challenges the player to answer a series of standards based subject specific questions in new and inventive ways. Worksheets are a thing of the past.</p>\n<h3>Brain Drain</h3>\n<p><a href=\"https://youtu.be/TeTAb5nN77c\" rel=\"nofollow\">Video Here</a></p>\n<p>During dark and troubling times, two doctors are hard at work in their wicked laboratory.  It is in this dark and evil place that Dr. Apprentice and Dr. Novice create a potential world changing virus.  They have created the “Phantom Virus” which takes kids from hard working, intelligent students, to “phantoms” who walk around repeating different academic questions until they receive an answer.</p>\n<p>Dr. Apprentice and Dr. Novice finally had their virus, but they did not know how to release its wrath upon the world. Finally they thought of a brilliant plan…they put the virus in unhealthy foods! Sodas, candy, any food that they knew kids liked but that was not good for them got dosed with the Phantom Virus.  Within days the virus started to spread world-wide. They thought they had won; they celebrated because they did not think there was anyone who could stop them!  But…mankind’s last hope rested with a brother and sister duo. Backed by their two beagles, they were ready to save the world!</p>\n<p>Watson and Spiller were playing outside when they started to notice all the adults were gone. All the sudden a turtle, raccoon and dog start talking to them! They explain about the virus and inform Spiller and Watson that they are the world’s only hope! Spiller and Watson knew they had to act fast if they were going to save the world! The animals did not want them to go, but they knew they were the up for the challenge. They loaded them up with plenty of fresh fruit, vegetables, toothbrushes, toothpaste, deodorant, and water to help fight off the Phantom kids if they needed to.\n “You will have help and protection out there” The animals looked at their pet beagles, Wendi and Jessi as they spoke.  </p>\n<p>Wendi and Jessi barked in agreement, letting them know that they would be there to protect them no matter what!\nThis is where you come in!</p>\n<p>You can play as either Spiller or Watson, and if you have a friend you can team up and play together!\nYou will travel around the world and as you come upon a Phantom, you have three choices.  You can answer their question correctly; throw fruits/vegetables/water/hygiene products at them to buy yourself some time while you think of the correct answer. Lastly, if you cannot think of an answer you can ask Wendi and Jessi for help, but be careful because they only can give you one answer each per level (unless you find some hidden dog treats throughout the level, and build up a few bonus answers).</p>\n<p>If you answer correctly you will cure the Phantom and turn him/her back into a child who is ready to join your army! You will need a giant army with you when you finally make it to the Doctor’s laboratory, where you will fight to take them out once and for all!</p>\n<p>Be prepared, each world offers different subjects you will have to conquer. </p>\n<p>The ultimate challenge of Brain Drain is there is no mouse or keyboard. YOU are the controller! If your character needs to jump, then you need to jump, if your character has to run, put your running shoes on because you will be moving! You will be out of your desk, moving, jumping, running and learning all at the same time! </p>\n<p>As you move around the world, you can collect other prizes to help you along the way. You will find scooters, bicycles, and roller skates to help you move faster. As you make your way from world to world, the questions will get harder, so be ready!  When you have to stop the game, you will return to “home base.” Here your mother will make you a home cooked meal, and you can rest up for the next day’s adventure. While at home, you will log onto your computer and see how many Phantoms you saved, what questions you were asked, and what % you answered correctly. This will allow you to understand what subjects you did well on, and what subjects you need to practice for the next round!\nDo you have the skills and willingness to study hard so that you can save the world from certain doom!? If so, get your mind ready and begin your adventure through Brain Drain! </p>\n<h2>How I built it:</h2>\n<p>Brain Drain is a virtual reality experience, therefore we built the educational game with Unity using the HTC VIVE Toolkit. We coded the game in C# and built assets with Blender. We also utilized Adobe Mixamo to help rig some of our custom created assets.</p>\n<h2>Challenges I ran into:</h2>\n<p>As we were all very new to development, one of the biggest hurdles was learning to collaborate with the tools at our disposal.  Coding and scene changes will have be easier for each of us to track once all members of our team have experience with git, and even though the Collab utility in Unity helped us bring our assets and scenes together in the end, it was enough to make development harder from the outset.</p>\n<p>Another challenge was in understanding how the interfaces of the SDKs, the Unity environment, and our own code needed to be made to be used together.  The mentors did all they could to show us how to implement a lot of our high-level ideas, but simple concepts such as how to create a script that can be triggered by an onclick() event within the 3D environment, or how to specify the parameters that are exposed in the very visual Unity window's UI, are an almost necessary aspect of learning Unity development from a scripting perspective.</p>\n<p>Overall, we had to overcome our newness to the technology, to working on a large software development project in a group, and working on such a tight deadline.  It's easy to appreciate that even the most experienced groups at this event had similar challenges, at their own level, and it's worth noting that we are no longer naive 'noobs' in the arena of VR/AR/MR/XR hacking!</p>\n<h2>Accomplishments that I'm proud of:</h2>\n<p>During the course of development, specific and intentional decisions were made so that this game will be played by students of all ability levels. Utilizing the latest technology including eye tracking, this game is engaging for all students. When we harness the power of VR we are only limited by our imaginations, and students who were left out of participating in the past due to wheelchairs, lack of fine motor skills, non-verbal communication, finally have an experience designed with them in mind.</p>\n<h2>What I learned:</h2>\n<p>That teamwork makes the dream work is not just a cute quip. This project was the living definition of that statement. This game idea has been a dream of mine for six years but I never had the right people to complete the dream. This team brought skills of unparalleled levels, ideas so ingenious I never could have imagined, and lifted this game with a pure sense of elegance.</p>\n<h2>What's next for test:</h2>\n<ul>\n<li>Multiple modes of interaction to accommodate students of various skill and ability</li>\n<li>The ability for teachers to take the basic framework and customize the environment to build in not only testing, but engaging lessons, exercises and multimodal, multimedia learning experiences</li>\n<li>Further development and a successful educational revolution! </li>\n</ul>\n</div>",
    "content_md": "\n## Inspiration:\n\n\nThere were two related but distinct inspirations behind Brain Drain. I have spent 13 years working as an educator and observing firsthand the desperate need for a change. As a society we are failing our students by refusing to update our educational practices. We need to stop trying to change the way they learn and start changing the way we teach. \n\n\nAs a special education teacher, I would watch my students fight and struggle to find a way to gain access to the curriculum equal to their general education peers. A new app would come out that “improved scores by so many percentage points” but it required the user to listen to prompts. My students who are deaf could not play that. Another new app would debut, but that one would require students to manipulate small numbers on the screen or type numbers in under a certain time. That eliminated my students with underdeveloped fine motor skills. The next “academic game” hits the market, and this one finally makes learning fun. In order to do that however, you have to visually sift through a massive array of information whilst multiple rounds of distracting noises are pummeling you. There goes the access for my students with Autism Spectrum Disorder.\n\n\nDuring the course of development, specific and intentional decisions were made so that this game will be played by students of all ability levels. Utilizing the latest technology including eye tracking, this game is engaging for all students. When we harness the power of VR we are only limited by our imaginations, and students who were left out of participating in the past due to wheelchairs, lack of fine motor skills, non-verbal communication, finally have an experience designed with them in mind. The best part about making those specific decisions is that it forced us to create new and inventive ways of responding to academic questions, and come to find out, those ways are fun for all kids.\n\n\n## What it does:\n\n\nChallenges the player to answer a series of standards based subject specific questions in new and inventive ways. Worksheets are a thing of the past.\n\n\n### Brain Drain\n\n\n[Video Here](https://youtu.be/TeTAb5nN77c)\n\n\nDuring dark and troubling times, two doctors are hard at work in their wicked laboratory. It is in this dark and evil place that Dr. Apprentice and Dr. Novice create a potential world changing virus. They have created the “Phantom Virus” which takes kids from hard working, intelligent students, to “phantoms” who walk around repeating different academic questions until they receive an answer.\n\n\nDr. Apprentice and Dr. Novice finally had their virus, but they did not know how to release its wrath upon the world. Finally they thought of a brilliant plan…they put the virus in unhealthy foods! Sodas, candy, any food that they knew kids liked but that was not good for them got dosed with the Phantom Virus. Within days the virus started to spread world-wide. They thought they had won; they celebrated because they did not think there was anyone who could stop them! But…mankind’s last hope rested with a brother and sister duo. Backed by their two beagles, they were ready to save the world!\n\n\nWatson and Spiller were playing outside when they started to notice all the adults were gone. All the sudden a turtle, raccoon and dog start talking to them! They explain about the virus and inform Spiller and Watson that they are the world’s only hope! Spiller and Watson knew they had to act fast if they were going to save the world! The animals did not want them to go, but they knew they were the up for the challenge. They loaded them up with plenty of fresh fruit, vegetables, toothbrushes, toothpaste, deodorant, and water to help fight off the Phantom kids if they needed to.\n “You will have help and protection out there” The animals looked at their pet beagles, Wendi and Jessi as they spoke. \n\n\nWendi and Jessi barked in agreement, letting them know that they would be there to protect them no matter what!\nThis is where you come in!\n\n\nYou can play as either Spiller or Watson, and if you have a friend you can team up and play together!\nYou will travel around the world and as you come upon a Phantom, you have three choices. You can answer their question correctly; throw fruits/vegetables/water/hygiene products at them to buy yourself some time while you think of the correct answer. Lastly, if you cannot think of an answer you can ask Wendi and Jessi for help, but be careful because they only can give you one answer each per level (unless you find some hidden dog treats throughout the level, and build up a few bonus answers).\n\n\nIf you answer correctly you will cure the Phantom and turn him/her back into a child who is ready to join your army! You will need a giant army with you when you finally make it to the Doctor’s laboratory, where you will fight to take them out once and for all!\n\n\nBe prepared, each world offers different subjects you will have to conquer. \n\n\nThe ultimate challenge of Brain Drain is there is no mouse or keyboard. YOU are the controller! If your character needs to jump, then you need to jump, if your character has to run, put your running shoes on because you will be moving! You will be out of your desk, moving, jumping, running and learning all at the same time! \n\n\nAs you move around the world, you can collect other prizes to help you along the way. You will find scooters, bicycles, and roller skates to help you move faster. As you make your way from world to world, the questions will get harder, so be ready! When you have to stop the game, you will return to “home base.” Here your mother will make you a home cooked meal, and you can rest up for the next day’s adventure. While at home, you will log onto your computer and see how many Phantoms you saved, what questions you were asked, and what % you answered correctly. This will allow you to understand what subjects you did well on, and what subjects you need to practice for the next round!\nDo you have the skills and willingness to study hard so that you can save the world from certain doom!? If so, get your mind ready and begin your adventure through Brain Drain! \n\n\n## How I built it:\n\n\nBrain Drain is a virtual reality experience, therefore we built the educational game with Unity using the HTC VIVE Toolkit. We coded the game in C# and built assets with Blender. We also utilized Adobe Mixamo to help rig some of our custom created assets.\n\n\n## Challenges I ran into:\n\n\nAs we were all very new to development, one of the biggest hurdles was learning to collaborate with the tools at our disposal. Coding and scene changes will have be easier for each of us to track once all members of our team have experience with git, and even though the Collab utility in Unity helped us bring our assets and scenes together in the end, it was enough to make development harder from the outset.\n\n\nAnother challenge was in understanding how the interfaces of the SDKs, the Unity environment, and our own code needed to be made to be used together. The mentors did all they could to show us how to implement a lot of our high-level ideas, but simple concepts such as how to create a script that can be triggered by an onclick() event within the 3D environment, or how to specify the parameters that are exposed in the very visual Unity window's UI, are an almost necessary aspect of learning Unity development from a scripting perspective.\n\n\nOverall, we had to overcome our newness to the technology, to working on a large software development project in a group, and working on such a tight deadline. It's easy to appreciate that even the most experienced groups at this event had similar challenges, at their own level, and it's worth noting that we are no longer naive 'noobs' in the arena of VR/AR/MR/XR hacking!\n\n\n## Accomplishments that I'm proud of:\n\n\nDuring the course of development, specific and intentional decisions were made so that this game will be played by students of all ability levels. Utilizing the latest technology including eye tracking, this game is engaging for all students. When we harness the power of VR we are only limited by our imaginations, and students who were left out of participating in the past due to wheelchairs, lack of fine motor skills, non-verbal communication, finally have an experience designed with them in mind.\n\n\n## What I learned:\n\n\nThat teamwork makes the dream work is not just a cute quip. This project was the living definition of that statement. This game idea has been a dream of mine for six years but I never had the right people to complete the dream. This team brought skills of unparalleled levels, ideas so ingenious I never could have imagined, and lifted this game with a pure sense of elegance.\n\n\n## What's next for test:\n\n\n* Multiple modes of interaction to accommodate students of various skill and ability\n* The ability for teachers to take the basic framework and customize the environment to build in not only testing, but engaging lessons, exercises and multimodal, multimedia learning experiences\n* Further development and a successful educational revolution!\n\n\n"
}