{
    "source": "https://devpost.com/software/pan-gu",
    "title": "Pan Gu",
    "blurb": "A fun experience allowing you to become a god who can manipulate the 5 elements: Metal, Water, Wood, Fire, Earth to create impressive reactions of the elements with massive GPU generated particles. ",
    "awards": [],
    "videos": [
        "https://player.vimeo.com/video/385868599?byline=0&portrait=0&title=0#t="
    ],
    "images": [],
    "team": [
        {
            "name": "Wei Dai",
            "about": "I worked on all the interaction design (gestures, gesture-interactions, interactions between different particles), user experience design and the programming of instrumental control system.",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/000/747/064/datas/profile.jpeg"
        },
        {
            "name": "Dawn Nguyen",
            "about": "I worked on the Storyline (initial Journey Map), brainstorming the interaction with Wei, created the LWRP Shaders for the 5 elements, designed the UI for the interaction tutorial, worked with Wei on the Sound Effects, and preparing content for our submission",
            "photo": "https://avatars2.githubusercontent.com/u/15383891?height=180&v=4&width=180"
        },
        {
            "name": "Rustin Wollin",
            "about": "I implemented the fluid particle simulation, interactions between particles, and developed additional shaders",
            "photo": "https://avatars2.githubusercontent.com/u/3959144?height=180&v=4&width=180"
        },
        {
            "name": "julia biasi",
            "about": "",
            "photo": "https://www.gravatar.com/avatar/95ef36f84ce5aa6e9ad43b457157d608?d=https%3A%2F%2Fdevpost-challengepost.netdna-ssl.com%2Fassets%2Fdefaults%2Fno-avatar-180.png&s=180"
        }
    ],
    "built_with": [
        "c#",
        "oculus-gear-vr",
        "photoshop",
        "tilt-brush",
        "unity"
    ],
    "content_html": "<div>\n<h2>Inspiration</h2>\n<p>The project is loosely based on the Chinese creation mythology, where the world is built by the giant, Pan Gu, with five traditional Chinese elements. We are also inspired by previous experiments with particle sandbox toys in the vein of the classic Falling Sand games.  We started out with a vision of creating a large scale, fun and impressive visual experience simulating physical particles or fluids. </p>\n<h2>What it does</h2>\n<p>It is a virtual playground where players play as Pan Gu, a progenitor god of ancient Chinese mythology, and use different gestures to manipulate massive amounts of GPU generated particles. There are 5 types of particles representing the 5 elements, different reactions occur when two different types of particles collide with each other. We also use players' hand-movement as an instrument to let them compose and play their own music while playing in VR. Using spheres as physical particles, the interaction of the user with the spheres causing their collision, and morphing from one element to another.</p>\n<h2>How we built it</h2>\n<p>We started developing our ideas by brainstorming and creating the experience journey map in Miro Board. The team also explored different interactions and sound effects to improve the immersive and engagement for the experience. With every interaction, we hope we can spark a positive emotion from our players. </p>\n<p>Wei focused on interaction design and experimenting different form of hand gestures and implemented them using Unity.</p>\n<p>Rustin converted a reference OpenGL implementation of SPH on the GPU into a version targeting Unity's Compute Shader API, then implemented a system for processing the gesture input data as part of the particle system update loop. Once these basic interactions were finished, more types of elements and interactions between elements were programmed to create the feeling of a dynamic environment where particles react to create interesting emergent interactions.</p>\n<p>Julia created 5 elements in Tilt Brush to populate in the environment. Dawn used Photoshop to design the Interaction Tutorial UI and used Shader Graph to create some materials under LWRP for the experience.</p>\n<h2>Challenges we ran into</h2>\n<p>Originally we were going to target Unity's Lightweight Render Pipeline, but ran into poor support for previewing scenes on Oculus Quest and had to abandon LWRP halfway through.\nMost of Saturday ended up being wasted on first a C# Job System implementation of SPH with improved spatial partitioning, and then a hybrid method where neighbor lists are calculated on the CPU and sent to the GPU every frame, but both methods actually ended up slower than a simple brute force implementation on the GPU!</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>The interaction between different elements and the four gestures used to control these particles are insanely satisfying. We managed to have hall 5 types of particles and 4 ways of interaction working (Thanks to our programming powerhouse, Rustin). Our original design has really good outcomes. Another accomplishment we are proud of is that you can generate different beats and sound and compose your own music simply with your hand-movements. It really brings another layer of drama and emotion to the already awesome particle interactions.</p>\n<h2>What we learned</h2>\n<p>Implementing particles with limited lifetimes that can be removed from the GPU compute buffer at runtime, as well as particles that dynamically spawn other particles, originally seemed like it might be out of scope for a 2.5 day hackathon, but the functionality turned out to be fairly straightforward using an AppendStructuredBuffer.\nImplementing particle interactions once the basic physics simulation was working turned out to be deceptively simple and we saw some really interesting emergent behavior with relatively simple rules.</p>\n<h2>What's next for Pan Gu</h2>\n<p>Pan Gu will have the ability to create terrain, weather, ocean and animals out of the 5 elements.  Our player will also have the ability to teleport and move higher and far away to see their creation. Further than that, this will also be a multiplayer experience, where the other player will play as \"human\" and seeing how Pan Gu is manipulating the 5 elements in their world. </p>\n</div>",
    "content_md": "\n## Inspiration\n\n\nThe project is loosely based on the Chinese creation mythology, where the world is built by the giant, Pan Gu, with five traditional Chinese elements. We are also inspired by previous experiments with particle sandbox toys in the vein of the classic Falling Sand games. We started out with a vision of creating a large scale, fun and impressive visual experience simulating physical particles or fluids. \n\n\n## What it does\n\n\nIt is a virtual playground where players play as Pan Gu, a progenitor god of ancient Chinese mythology, and use different gestures to manipulate massive amounts of GPU generated particles. There are 5 types of particles representing the 5 elements, different reactions occur when two different types of particles collide with each other. We also use players' hand-movement as an instrument to let them compose and play their own music while playing in VR. Using spheres as physical particles, the interaction of the user with the spheres causing their collision, and morphing from one element to another.\n\n\n## How we built it\n\n\nWe started developing our ideas by brainstorming and creating the experience journey map in Miro Board. The team also explored different interactions and sound effects to improve the immersive and engagement for the experience. With every interaction, we hope we can spark a positive emotion from our players. \n\n\nWei focused on interaction design and experimenting different form of hand gestures and implemented them using Unity.\n\n\nRustin converted a reference OpenGL implementation of SPH on the GPU into a version targeting Unity's Compute Shader API, then implemented a system for processing the gesture input data as part of the particle system update loop. Once these basic interactions were finished, more types of elements and interactions between elements were programmed to create the feeling of a dynamic environment where particles react to create interesting emergent interactions.\n\n\nJulia created 5 elements in Tilt Brush to populate in the environment. Dawn used Photoshop to design the Interaction Tutorial UI and used Shader Graph to create some materials under LWRP for the experience.\n\n\n## Challenges we ran into\n\n\nOriginally we were going to target Unity's Lightweight Render Pipeline, but ran into poor support for previewing scenes on Oculus Quest and had to abandon LWRP halfway through.\nMost of Saturday ended up being wasted on first a C# Job System implementation of SPH with improved spatial partitioning, and then a hybrid method where neighbor lists are calculated on the CPU and sent to the GPU every frame, but both methods actually ended up slower than a simple brute force implementation on the GPU!\n\n\n## Accomplishments that we're proud of\n\n\nThe interaction between different elements and the four gestures used to control these particles are insanely satisfying. We managed to have hall 5 types of particles and 4 ways of interaction working (Thanks to our programming powerhouse, Rustin). Our original design has really good outcomes. Another accomplishment we are proud of is that you can generate different beats and sound and compose your own music simply with your hand-movements. It really brings another layer of drama and emotion to the already awesome particle interactions.\n\n\n## What we learned\n\n\nImplementing particles with limited lifetimes that can be removed from the GPU compute buffer at runtime, as well as particles that dynamically spawn other particles, originally seemed like it might be out of scope for a 2.5 day hackathon, but the functionality turned out to be fairly straightforward using an AppendStructuredBuffer.\nImplementing particle interactions once the basic physics simulation was working turned out to be deceptively simple and we saw some really interesting emergent behavior with relatively simple rules.\n\n\n## What's next for Pan Gu\n\n\nPan Gu will have the ability to create terrain, weather, ocean and animals out of the 5 elements. Our player will also have the ability to teleport and move higher and far away to see their creation. Further than that, this will also be a multiplayer experience, where the other player will play as \"human\" and seeing how Pan Gu is manipulating the 5 elements in their world. \n\n\n"
}