{
    "source": "https://devpost.com/software/planet-protector-b18jfi",
    "title": "Planet Protector",
    "blurb": "So you think you recycle? Come test your skills with our immersive gameplay experience. You think you know, but you have no idea.",
    "awards": [],
    "videos": [
        "https://www.youtube.com/embed/nTH_bkvTseE?enablejsapi=1&hl=en_US&rel=0&start=&version=3&wmode=transparent"
    ],
    "images": [
        {
            "title": "Carrie tests out the final product",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/916/902/datas/original.jpg"
        },
        {
            "title": "Jay hard at work",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/916/903/datas/original.jpg"
        },
        {
            "title": "Jose hard at work",
            "src": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/916/905/datas/original.jpg"
        }
    ],
    "team": [
        {
            "name": "Jose E. Pimentel",
            "about": "Wrote AFrame code for game mechanics. Most of it didnt make it into the main experience due to time constraints but there's an \"arcade\" mode that's just the game mechanics without any of the storytelling",
            "photo": "https://avatars3.githubusercontent.com/u/6427690?height=180&v=4&width=180"
        },
        {
            "name": "Jay Williamson",
            "about": "Sound design, visual graphics and demo video",
            "photo": "https://media.licdn.com/dms/image/C4E03AQE7wGzLNM7F2w/profile-displayphoto-shrink_100_100/0?e=1547683200&height=180&t=FTT-eN86Xrbu-SPJc-vT92Vp3NkewK83UgQS_bBs5jU&v=beta&width=180"
        },
        {
            "name": "Danielle Levin",
            "about": "",
            "photo": "https://www.gravatar.com/avatar/ef7d6481f45306765b58bdb399b15258?d=https%3A%2F%2Fdevpost-challengepost.netdna-ssl.com%2Fassets%2Fdefaults%2Fno-avatar-180.png&s=180"
        },
        {
            "name": "Carrie Carter",
            "about": "",
            "photo": "https://media-exp2.licdn.com/dms/image/C5603AQEFgOJwGtUIIQ/profile-displayphoto-shrink_800_800/0?e=1585180800&height=180&t=Qq15XHiugTLrXKaEBSmK2rUghbK-Jgn4A4jU3nEO0JE&v=beta&width=180"
        }
    ],
    "built_with": [
        "3.js",
        "a-frame",
        "autodesk-fusion-360",
        "html",
        "javascript"
    ],
    "content_html": "<div>\n<h2>Inspiration</h2>\n<p>We came together around a shared passion for VR’s ability to deepen empathy and create a sense of common humanity.  After brainstorming the many issues we hoped shine a light on, we settled on a topic close to all of us: sustainability.</p>\n<p>Every day, well-meaning people do their part to protect the planet by recycling their trash. It is one of the most prevalent daily sustainability behaviors in U.S., and it is the only one taught throughout the country’s public and private school system. But do we actually know what happens to our trash when we recycle it? </p>\n<p>The reality is, we are devoting our energy to a practice that is stunningly inefficient, while ignoring other, more impactful behaviors we could focus on to protect and sustain natural resources.</p>\n<p>How could we help users who want to be responsible stewards of the earth, but don’t have the bandwidth to identify the most impactful behaviors? Enter, Planet Protector!</p>\n<h2>What it does</h2>\n<p><strong>Planet Protector</strong> <em>Expand your awareness</em></p>\n<p>Planet Protector is an immersive educational experience, in which users learn the realities of waste management and its impact on the environment through a short gameplay and world exploring experience.  Planet Protector trains users to think more deeply about unseen elements of our consumption: what happens to trash after we throw it out? How can sustainability be incorporated farther up the production chain, before items arrive in our homes?  More than simply a device for educating users on the facts of recycling, Planet Protector trains users to extend their awareness across all kinds of behaviors, encouraging us to notice the impact of our choices beyond what is immediately visible to us. </p>\n<p>Ultimately, Planet Protector is about creating a world where each of us is aware of the downstream consequences of our choices, and we are equipped to make the most responsible choice possible.  </p>\n<h2>How we built it</h2>\n<p>We thought about each of our own daily behaviors, and we designed the experience for a user most similar to ourselves: people who aspired to act in a sustainably responsible fashion, but who didn’t devote significant time to researching the implications of our consumption and waste choices. We decided to narrow our scope to focus on a single element of sustainability, recycling, because it was the most common daily habit for each of us.</p>\n<p>We educated ourselves, researching global trends in recycling and the impact of inefficient waste management processes in the context of an ongoing climate crisis. Having immersed ourselves in the data, we set out to design the user experience to mimic our own daily behavior in the real world: comfortably engaging in low-effort, validating behaviors like recycling (which is reflected in the easy gameplay in the first half of the experience), followed by an abrupt dose of reality about the relative ineffectiveness of those behaviors (reflected in the narration and scene change in the second half of the experience).* </p>\n<p>We wanted the experience to be accessible to all users, on any platform, so we built using Web XR to take advantage of the potential for Web-based VR experiences.</p>\n<ul>\n<li>We utilized the A-Frame library which is coded with Javascript</li>\n<li>Being web-based allowed us to iterate and build much more quickly than other environments</li>\n<li>Users can engage with our experience by simply viewing our site within a VR headset; no sideloading necessary</li>\n<li>We support any 6DOF headset with hand controllers now and in the future</li>\n<li>Full controller support allows for the users to interact with the environment</li>\n<li>We utilized a physics library to allow for a sandbox of interaction possibilities</li>\n</ul>\n<p>Throughout the process, we checked in on our design choices to ensure we stayed true to the goals for the user and the design principles we’d outlined at the beginning of the hackathon. Those included:\n<em>Goals:</em></p>\n<ul>\n<li>Empathy-building, resonant experience</li>\n<li>Explore an unseen world\n<em>Principles:</em></li>\n<li>Don’t shy away from discomfort, but don’t create discomfort for the sake of it</li>\n<li>Stay true to the story and remain personal; elevate unheard voices or stories</li>\n<li>Responsible and caring toward user</li>\n<li>Accessible</li>\n</ul>\n<p>*Note: our intention is not to discourage users from recycling! Far from it, we hope this experience reinforces their existing efforts, while empowering them to take addition steps to reduce their waste footprint earlier in their consumption habits.</p>\n<h2>Challenges we ran into</h2>\n<p>We hit our most significant snag on the evening of Day 1. We had quickly landed on a topic that excited all of us that morning; we then spent the day storyboarding, meticulously outlining audio and visual assets, scripts and a project plan. Late that night, we discovered the Stanford Virtual Human Interaction Lab had already developed the same concept (presumably with more time and resources!). The story, style and user experience were all too close to our ideas to continue with our plan.  We were faced with a dilemma: keep the <a href=\"https://vhil.stanford.edu/becominghomeless/\" rel=\"nofollow\">same concept</a> and try to say something new on the topic, or throw it out and start with something fresh. </p>\n<p>Fortunately, at the beginning of the day, we’d taken a moment to get to know one another before starting our planning. Carrie, our industrial design student, had shared something she’d learned from her experiences in art school: be unafraid to throw it out and start all over again.</p>\n<p>Encouraged and emboldened by this, we gave ourselves the freedom to explore new concepts, and we quickly discovered we had a shared passion for sustainability.  The ideas started flowing, and we brainstormed until we were confident we’d be able to pivot topics with the time left, while still staying true to the goals and principles we outlined in our first brainstorm.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We finished and shipped an MVP!</p>\n<p>Each of us brought a wide spectrum of skills: some are freelance or professional developers, some have art and design experience, and some had put on their first VR headset only a few weeks before the hackathon! We found a role for everybody on the team, and we were able to make use of and celebrate each person’s individual strengths, while creating opportunities for learning for all. We approached our work with awareness of our own blindspots and with a desire to improve ourselves; we are proud to have worked on a team that lived the behaviors we hope to encourage in our users.</p>\n<h2>What we learned</h2>\n<p>We each learned a lot about our own recycling behaviors!  That was one of the hardest parts of the hackathon: the more we researched and built our product, the more we began to notice the unsustainable practices committed by us and others.</p>\n<p>We improved our skills with A-Frame and developed critical sprint skills: how to iterate quickly and when to be unafraid of starting over.  </p>\n<h2>What's next for Planet Protector</h2>\n<p>We have big visions for Planet Protector!  We’d like to merge other elements into the game play to build out the initial scene, and we’d like to expand the user’s ability to explore and interact with their environment, including additional educational elements. </p>\n</div>",
    "content_md": "\n## Inspiration\n\n\nWe came together around a shared passion for VR’s ability to deepen empathy and create a sense of common humanity. After brainstorming the many issues we hoped shine a light on, we settled on a topic close to all of us: sustainability.\n\n\nEvery day, well-meaning people do their part to protect the planet by recycling their trash. It is one of the most prevalent daily sustainability behaviors in U.S., and it is the only one taught throughout the country’s public and private school system. But do we actually know what happens to our trash when we recycle it? \n\n\nThe reality is, we are devoting our energy to a practice that is stunningly inefficient, while ignoring other, more impactful behaviors we could focus on to protect and sustain natural resources.\n\n\nHow could we help users who want to be responsible stewards of the earth, but don’t have the bandwidth to identify the most impactful behaviors? Enter, Planet Protector!\n\n\n## What it does\n\n\n**Planet Protector** *Expand your awareness*\n\n\nPlanet Protector is an immersive educational experience, in which users learn the realities of waste management and its impact on the environment through a short gameplay and world exploring experience. Planet Protector trains users to think more deeply about unseen elements of our consumption: what happens to trash after we throw it out? How can sustainability be incorporated farther up the production chain, before items arrive in our homes? More than simply a device for educating users on the facts of recycling, Planet Protector trains users to extend their awareness across all kinds of behaviors, encouraging us to notice the impact of our choices beyond what is immediately visible to us. \n\n\nUltimately, Planet Protector is about creating a world where each of us is aware of the downstream consequences of our choices, and we are equipped to make the most responsible choice possible. \n\n\n## How we built it\n\n\nWe thought about each of our own daily behaviors, and we designed the experience for a user most similar to ourselves: people who aspired to act in a sustainably responsible fashion, but who didn’t devote significant time to researching the implications of our consumption and waste choices. We decided to narrow our scope to focus on a single element of sustainability, recycling, because it was the most common daily habit for each of us.\n\n\nWe educated ourselves, researching global trends in recycling and the impact of inefficient waste management processes in the context of an ongoing climate crisis. Having immersed ourselves in the data, we set out to design the user experience to mimic our own daily behavior in the real world: comfortably engaging in low-effort, validating behaviors like recycling (which is reflected in the easy gameplay in the first half of the experience), followed by an abrupt dose of reality about the relative ineffectiveness of those behaviors (reflected in the narration and scene change in the second half of the experience).* \n\n\nWe wanted the experience to be accessible to all users, on any platform, so we built using Web XR to take advantage of the potential for Web-based VR experiences.\n\n\n* We utilized the A-Frame library which is coded with Javascript\n* Being web-based allowed us to iterate and build much more quickly than other environments\n* Users can engage with our experience by simply viewing our site within a VR headset; no sideloading necessary\n* We support any 6DOF headset with hand controllers now and in the future\n* Full controller support allows for the users to interact with the environment\n* We utilized a physics library to allow for a sandbox of interaction possibilities\n\n\nThroughout the process, we checked in on our design choices to ensure we stayed true to the goals for the user and the design principles we’d outlined at the beginning of the hackathon. Those included:\n*Goals:*\n\n\n* Empathy-building, resonant experience\n* Explore an unseen world\n*Principles:*\n* Don’t shy away from discomfort, but don’t create discomfort for the sake of it\n* Stay true to the story and remain personal; elevate unheard voices or stories\n* Responsible and caring toward user\n* Accessible\n\n\n*Note: our intention is not to discourage users from recycling! Far from it, we hope this experience reinforces their existing efforts, while empowering them to take addition steps to reduce their waste footprint earlier in their consumption habits.\n\n\n## Challenges we ran into\n\n\nWe hit our most significant snag on the evening of Day 1. We had quickly landed on a topic that excited all of us that morning; we then spent the day storyboarding, meticulously outlining audio and visual assets, scripts and a project plan. Late that night, we discovered the Stanford Virtual Human Interaction Lab had already developed the same concept (presumably with more time and resources!). The story, style and user experience were all too close to our ideas to continue with our plan. We were faced with a dilemma: keep the [same concept](https://vhil.stanford.edu/becominghomeless/) and try to say something new on the topic, or throw it out and start with something fresh. \n\n\nFortunately, at the beginning of the day, we’d taken a moment to get to know one another before starting our planning. Carrie, our industrial design student, had shared something she’d learned from her experiences in art school: be unafraid to throw it out and start all over again.\n\n\nEncouraged and emboldened by this, we gave ourselves the freedom to explore new concepts, and we quickly discovered we had a shared passion for sustainability. The ideas started flowing, and we brainstormed until we were confident we’d be able to pivot topics with the time left, while still staying true to the goals and principles we outlined in our first brainstorm.\n\n\n## Accomplishments that we're proud of\n\n\nWe finished and shipped an MVP!\n\n\nEach of us brought a wide spectrum of skills: some are freelance or professional developers, some have art and design experience, and some had put on their first VR headset only a few weeks before the hackathon! We found a role for everybody on the team, and we were able to make use of and celebrate each person’s individual strengths, while creating opportunities for learning for all. We approached our work with awareness of our own blindspots and with a desire to improve ourselves; we are proud to have worked on a team that lived the behaviors we hope to encourage in our users.\n\n\n## What we learned\n\n\nWe each learned a lot about our own recycling behaviors! That was one of the hardest parts of the hackathon: the more we researched and built our product, the more we began to notice the unsustainable practices committed by us and others.\n\n\nWe improved our skills with A-Frame and developed critical sprint skills: how to iterate quickly and when to be unafraid of starting over. \n\n\n## What's next for Planet Protector\n\n\nWe have big visions for Planet Protector! We’d like to merge other elements into the game play to build out the initial scene, and we’d like to expand the user’s ability to explore and interact with their environment, including additional educational elements. \n\n\n"
}