{
    "source": "https://devpost.com/software/in-your-skin",
    "title": "In Your Skin",
    "blurb": "IYS is a VR experience that helps improve your empathy by seeing the world from a different skin than your own.",
    "awards": [],
    "videos": [],
    "images": [],
    "team": [
        {
            "name": "Barrie24",
            "about": "I developed the 3D models, design, and the scripting for the following of the avatars. ",
            "photo": "https://graph.facebook.com/1732642697044162/picture?height=180&width=180"
        },
        {
            "name": "Miranda Monroe",
            "about": "I developed 3d architectural models, edited skins, and implemented follow scripting.",
            "photo": "https://media.licdn.com/mpr/mprx/0__NBxO7ijA-eWq527oLSl1glpv6aHqzKiEL3ARVjpNheWq5gOuN7xKoQpPvqHqqiPkn7OxHWyMGCdBApaoFt_9UeKpGCeBlJx2FtyjsggciBXgbGi8nX-gaPuyBZZOlmm5k9PsXNk29p?height=180&width=180"
        },
        {
            "name": "Elaine Harris",
            "about": "",
            "photo": "https://avatars2.githubusercontent.com/u/32585506?height=180&v=4&width=180"
        },
        {
            "name": "Imen Maaroufi",
            "about": "",
            "photo": "https://media.licdn.com/mpr/mprx/0_-m7HL3c6fJRjeSoBj0JHwXgFERETmuNB40RQ_NR6wj6hmpqw-EB6Sz9FHYvha0MFY0BWenvbiY68DHvcOjEqDzNwQY63DHKIOjEI6qTQSx1SFOwBtup5Q87B6IpAkHFVBYaXTQyfcV-?height=180&width=180"
        },
        {
            "name": "Dan Feng",
            "about": "",
            "photo": "https://www.gravatar.com/avatar/3f67876796b5fe38abfcc6185b39db80?d=https%3A%2F%2Fdevpost-challengepost.netdna-ssl.com%2Fassets%2Fdefaults%2Fno-avatar-180.png&s=180"
        }
    ],
    "built_with": [
        "freesound.org",
        "htcunity-plug-in",
        "instantvr",
        "steamvr",
        "unity"
    ],
    "content_html": "<div>\n<h2>Inspiration</h2>\n<p>In a diverse world, where humans are tending to be global citizens, minorities still face discrimination. Through In Your skin immersive experience, we help individuals get our of their comfort zone to experience what others feel, see and hear. The objective of this experience is to build empathy, eliminate discrimination and change the world for the better thanks to VR technology.</p>\n<h2>What it does</h2>\n<p>In Your Skin, provides a virtual experience in a different body than yours to help you feel what another feels. Different scenarios, based on real life experiences, are projected to establish connection between the user and their alternate reality.  </p>\n<h2>How we built it</h2>\n<p>With a team of 5 women from different backgrounds, we were able to allocate design, development, UX, storytelling, and business resources to build a store environment and shopping scenarios, where the user is a shopper who sees himself in the mirror, decides on his avatar/experience, leaves the fitting room, and meets the outside world that will treat him differently every time.</p>\n<p>We used 3D modeling to design and create the assets, setting on Cinema4D, and programming the models on Unity.</p>\n<h2>Challenges we ran into</h2>\n<p>The problem of bias that In Your Skin is trying to address is sensitive. We had to be thoughtful and mindful of others’ feelings and not perpetuate stereotypes, but also be honest in exposing the problem.  The time constraints limited the possible scenarios we could develop, so we chose a single setting- a store that sells apparel- and we limited  avatar variables to race.  We also faced technical challenges as motion tracking with the 3D models, transferring shaders from C4D to Unity, and hardware problems using HTC Vive.  The base stations did not function consistently.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>The most relevant outcome of this hackathon was to be able to quickly bond and work as a team with women from different backgrounds who had never met each other.  Each readily embraced the concept,worked hard, and did their best to make it happen.</p>\n<p>The motivation we were able to keep, even with some technical issues, was outstanding. We are also proud of the willingness to do, and learn by doing.  </p>\n<p>We were pleasantly surprised with the number of other hackathon participants who sought us out to tell us how much they liked our idea.  We were interviewed by a freelance reporter and our journey has been documented in photography and video by a reporter from a Japanese magazine.</p>\n<h2>What we learned</h2>\n<p>We learned a lot about the components of VR, developing for VR, and working under pressure to deliver on time. \nAnd perhaps, most importantly, we learned to work as a team with members who were previously strangers but became united around shared values and striving together for excellence. </p>\n<h2>What's next for In Your Skin</h2>\n<p>We see In Your skin as a project that will be turned into a real business, where we use VR for Good and social justice. In Your Skin could be a training program for multiple institutions, enabling them to create more inclusive cultures that effectively utilize diverse talent.  Data shows that diverse organizations are the most successful. \nVariables of gender, ethnicity, physical impairment, and others can be explored.  Multiple scenarios can be developed and presented in sequences customized to users, AI interactivity can be added, more extensive experiences, such as a whole day in a different skin at work, a first day in school, a day in a new country, and more. In Your Skin could also be used in research and data collection for sociology, psychology and anthropology reasons, or for cultural studies. </p>\n</div>",
    "content_md": "\n## Inspiration\n\n\nIn a diverse world, where humans are tending to be global citizens, minorities still face discrimination. Through In Your skin immersive experience, we help individuals get our of their comfort zone to experience what others feel, see and hear. The objective of this experience is to build empathy, eliminate discrimination and change the world for the better thanks to VR technology.\n\n\n## What it does\n\n\nIn Your Skin, provides a virtual experience in a different body than yours to help you feel what another feels. Different scenarios, based on real life experiences, are projected to establish connection between the user and their alternate reality. \n\n\n## How we built it\n\n\nWith a team of 5 women from different backgrounds, we were able to allocate design, development, UX, storytelling, and business resources to build a store environment and shopping scenarios, where the user is a shopper who sees himself in the mirror, decides on his avatar/experience, leaves the fitting room, and meets the outside world that will treat him differently every time.\n\n\nWe used 3D modeling to design and create the assets, setting on Cinema4D, and programming the models on Unity.\n\n\n## Challenges we ran into\n\n\nThe problem of bias that In Your Skin is trying to address is sensitive. We had to be thoughtful and mindful of others’ feelings and not perpetuate stereotypes, but also be honest in exposing the problem. The time constraints limited the possible scenarios we could develop, so we chose a single setting- a store that sells apparel- and we limited avatar variables to race. We also faced technical challenges as motion tracking with the 3D models, transferring shaders from C4D to Unity, and hardware problems using HTC Vive. The base stations did not function consistently.\n\n\n## Accomplishments that we're proud of\n\n\nThe most relevant outcome of this hackathon was to be able to quickly bond and work as a team with women from different backgrounds who had never met each other. Each readily embraced the concept,worked hard, and did their best to make it happen.\n\n\nThe motivation we were able to keep, even with some technical issues, was outstanding. We are also proud of the willingness to do, and learn by doing. \n\n\nWe were pleasantly surprised with the number of other hackathon participants who sought us out to tell us how much they liked our idea. We were interviewed by a freelance reporter and our journey has been documented in photography and video by a reporter from a Japanese magazine.\n\n\n## What we learned\n\n\nWe learned a lot about the components of VR, developing for VR, and working under pressure to deliver on time. \nAnd perhaps, most importantly, we learned to work as a team with members who were previously strangers but became united around shared values and striving together for excellence. \n\n\n## What's next for In Your Skin\n\n\nWe see In Your skin as a project that will be turned into a real business, where we use VR for Good and social justice. In Your Skin could be a training program for multiple institutions, enabling them to create more inclusive cultures that effectively utilize diverse talent. Data shows that diverse organizations are the most successful. \nVariables of gender, ethnicity, physical impairment, and others can be explored. Multiple scenarios can be developed and presented in sequences customized to users, AI interactivity can be added, more extensive experiences, such as a whole day in a different skin at work, a first day in school, a day in a new country, and more. In Your Skin could also be used in research and data collection for sociology, psychology and anthropology reasons, or for cultural studies. \n\n\n"
}