{
    "source": "https://devpost.com/software/depress-the-depression",
    "title": "FightMind",
    "blurb": "FightMind is an all-in-one platform to fight depression in youngsters and to introduce them to augmented reality meditation, peer interaction, and receive guidance from our mental health therapists.",
    "awards": [
        "Participation Prize",
        "First Overall",
        "Best Domain Name from GoDaddy Registry [APAC Only]"
    ],
    "videos": [
        "https://www.youtube.com/embed/VJJg6YZvgjY?enablejsapi=1&hl=en_US&rel=0&start=&version=3&wmode=transparent"
    ],
    "images": [],
    "team": [
        {
            "name": "AKSHITA GUPTA",
            "about": "I worked on the Augmented reality part of the website and the video editing",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/001/100/297/datas/profile.jpeg"
        },
        {
            "name": "Angelin Varghese",
            "about": "I worked on the mental-health page of the website using html and CSS.It was great working as a team.\n",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/001/664/934/datas/profile.jpeg"
        },
        {
            "name": "Anwisha Zaman",
            "about": "I worked on the front end of the website using html ,css,js.\nAlso made the content of the website .",
            "photo": "//challengepost-s3-challengepost.netdna-ssl.com/photos/production/user_photos/001/664/935/datas/profile.jpeg"
        }
    ],
    "built_with": [
        "css3",
        "echoar",
        "html5",
        "javascript",
        "unity"
    ],
    "content_html": "<div>\n<h2>Our team code is 25689855</h2>\n<h2>Inspiration</h2>\n<p><strong>LIFE IS VALUABLE!!!</strong></p>\n<p>Lack of sleep, bad eating habits, and insufficient exercise are all factors that contribute to depression in college students. Academic stress, which includes financial concerns, pressure to find a decent career after graduation, and failed relationships, is enough to drive some students to drop out of college or worse. We must teach our people to be content with themselves and friendly with others, and we must free them from the mind's complicated psychological gymnastics.</p>\n<p>Peace is something that people who are living in the middle of terrible conflict yearn for and desire. \n                                       <strong>Pain is inevitable but suffering is optional</strong>\nHaving a broad view of life provides you the courage to get through difficult situations. Know that you are very much needed in this world.  This life, with all of its limitless possibilities, is a gift because it has the potential to become a source of joy and happiness not just for oneself but also for your own family and friends. So we're here to help you get rid of all your problems and show you that <em>life can still be a brilliant and sparkling star in the dark sky</em>.</p>\n<h2>What it does</h2>\n<p>We have come up with some of the best features such as the events section which includes <strong>Yoga</strong> which may help reduce stress, lower blood pressure and lower your heart rate and also better the body posture and spine health, flexibility, balance, strength, and coordination.</p>\n<p>Endorphins, the chemicals in your brain that reduce pain and tension, are released when you exercise. It also lowers stress chemicals such as cortisol and adrenaline. We've introduced a section where you may book tickets and socialize with your peers by attending events together and as we know  <strong>AEROBICS and GYMNASTICS</strong>  helps to relax our muscles and reduces all the stress.</p>\n<p>Your  <strong>mental health</strong> , which encompasses your emotional, psychological, and social well-being, is our primary emphasis. It has an impact on the way you think, feel, and act. It also influences how we deal with stress, interacts with people, and make good decisions. As a result, we provide you with a free psychologist with whom you may contact at any time and make appointments.</p>\n<p>Most importantly, we provide <strong>Augmented Reality Meditation</strong> , which is an active, immersive, and visual experience. It assists you in achieving a profound level of relaxation and a calm mind. Helps us focus and clear our minds of the muddled ideas that may clog our minds and cause tension.in Augmented reality, we have added peaceful music to calm your mind through this difficult situation.</p>\n<h2>How we built it</h2>\n<p>We have built using Html,CSS,javascript,echoAR,unity</p>\n<h2>Challenges we ran into</h2>\n<p>We had never used JavaScript to the depth that we did for this project, and we had trouble making a way to compare each separate user-inputted item to our small database. We faced issues in aligning our Echo-AR models.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are proud that we have made a website that can reduce the depression of people and helps them come out of it positively and helps reduce suicidal rates as it's a serious rising issue. We are happy that our website will make an impact on young minds and help them think deeply about their life and take the right decision and even face difficult situations boldly.</p>\n<h2>What we learned</h2>\n<p>We learned the use of echoAR and how to embed augmented reality into our website. We learned Html and CSS at advanced levels. We came across the use of animate.css which helped us add effects to CSS content which made to look our page even more attractive.</p>\n<h2>What's next for FightMind</h2>\n<p>We'd want to create a community for them where they can interact with their peers while also providing security conditions. We will add more features, such as organizing events and providing them with journals in which they may write and for which we will award prizes motivating them to improve their writing abilities. We would like to add some more graphics which will add even more effect to our page.</p>\n</div>",
    "content_md": "\n## Our team code is 25689855\n\n\n## Inspiration\n\n\n**LIFE IS VALUABLE!!!**\n\n\nLack of sleep, bad eating habits, and insufficient exercise are all factors that contribute to depression in college students. Academic stress, which includes financial concerns, pressure to find a decent career after graduation, and failed relationships, is enough to drive some students to drop out of college or worse. We must teach our people to be content with themselves and friendly with others, and we must free them from the mind's complicated psychological gymnastics.\n\n\nPeace is something that people who are living in the middle of terrible conflict yearn for and desire. \n **Pain is inevitable but suffering is optional**\nHaving a broad view of life provides you the courage to get through difficult situations. Know that you are very much needed in this world. This life, with all of its limitless possibilities, is a gift because it has the potential to become a source of joy and happiness not just for oneself but also for your own family and friends. So we're here to help you get rid of all your problems and show you that *life can still be a brilliant and sparkling star in the dark sky*.\n\n\n## What it does\n\n\nWe have come up with some of the best features such as the events section which includes **Yoga** which may help reduce stress, lower blood pressure and lower your heart rate and also better the body posture and spine health, flexibility, balance, strength, and coordination.\n\n\nEndorphins, the chemicals in your brain that reduce pain and tension, are released when you exercise. It also lowers stress chemicals such as cortisol and adrenaline. We've introduced a section where you may book tickets and socialize with your peers by attending events together and as we know **AEROBICS and GYMNASTICS** helps to relax our muscles and reduces all the stress.\n\n\nYour **mental health** , which encompasses your emotional, psychological, and social well-being, is our primary emphasis. It has an impact on the way you think, feel, and act. It also influences how we deal with stress, interacts with people, and make good decisions. As a result, we provide you with a free psychologist with whom you may contact at any time and make appointments.\n\n\nMost importantly, we provide **Augmented Reality Meditation** , which is an active, immersive, and visual experience. It assists you in achieving a profound level of relaxation and a calm mind. Helps us focus and clear our minds of the muddled ideas that may clog our minds and cause tension.in Augmented reality, we have added peaceful music to calm your mind through this difficult situation.\n\n\n## How we built it\n\n\nWe have built using Html,CSS,javascript,echoAR,unity\n\n\n## Challenges we ran into\n\n\nWe had never used JavaScript to the depth that we did for this project, and we had trouble making a way to compare each separate user-inputted item to our small database. We faced issues in aligning our Echo-AR models.\n\n\n## Accomplishments that we're proud of\n\n\nWe are proud that we have made a website that can reduce the depression of people and helps them come out of it positively and helps reduce suicidal rates as it's a serious rising issue. We are happy that our website will make an impact on young minds and help them think deeply about their life and take the right decision and even face difficult situations boldly.\n\n\n## What we learned\n\n\nWe learned the use of echoAR and how to embed augmented reality into our website. We learned Html and CSS at advanced levels. We came across the use of animate.css which helped us add effects to CSS content which made to look our page even more attractive.\n\n\n## What's next for FightMind\n\n\nWe'd want to create a community for them where they can interact with their peers while also providing security conditions. We will add more features, such as organizing events and providing them with journals in which they may write and for which we will award prizes motivating them to improve their writing abilities. We would like to add some more graphics which will add even more effect to our page.\n\n\n"
}